<abi-corpus path='libnvpair.so' architecture='elf-amd-x86_64' soname='libnvpair.so.3'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='dump_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='nvpair_value_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_nvlist_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='aok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_nosleep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_nosleep_def' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_sleep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_sleep_def' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_fixed_ops' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_fixed_ops_def' size='40' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_hashtable_init_size' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_max_recursion' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/fnvpair.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libnvpair' language='LANG_C99'>
    <function-decl name='fnvpair_value_nvlist' mangled-name='fnvpair_value_nvlist' filepath='../../module/nvpair/fnvpair.c' line='583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_nvlist'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='583' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvpair_value_string' mangled-name='fnvpair_value_string' filepath='../../module/nvpair/fnvpair.c' line='575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_string'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='575' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' mangled-name='fnvpair_value_uint64' filepath='../../module/nvpair/fnvpair.c' line='567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint64'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='567' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint32' mangled-name='fnvpair_value_uint32' filepath='../../module/nvpair/fnvpair.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint32'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='559' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint16' mangled-name='fnvpair_value_uint16' filepath='../../module/nvpair/fnvpair.c' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint16'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='551' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint8' mangled-name='fnvpair_value_uint8' filepath='../../module/nvpair/fnvpair.c' line='543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint8'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='543' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvpair_value_int64' mangled-name='fnvpair_value_int64' filepath='../../module/nvpair/fnvpair.c' line='535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int64'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='535' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' mangled-name='fnvpair_value_int32' filepath='../../module/nvpair/fnvpair.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int32'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='527' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fnvpair_value_int16' mangled-name='fnvpair_value_int16' filepath='../../module/nvpair/fnvpair.c' line='519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int16'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='519' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='fnvpair_value_int8' mangled-name='fnvpair_value_int8' filepath='../../module/nvpair/fnvpair.c' line='511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int8'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='511' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fnvpair_value_byte' mangled-name='fnvpair_value_byte' filepath='../../module/nvpair/fnvpair.c' line='503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_byte'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='503' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='fnvpair_value_boolean_value' mangled-name='fnvpair_value_boolean_value' filepath='../../module/nvpair/fnvpair.c' line='495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_boolean_value'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='495' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64_array' mangled-name='fnvlist_lookup_uint64_array' filepath='../../module/nvpair/fnvpair.c' line='487' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint64_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='487' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='487' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/fnvpair.c' line='487' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int64_array' mangled-name='fnvlist_lookup_int64_array' filepath='../../module/nvpair/fnvpair.c' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int64_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='479' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='479' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/fnvpair.c' line='479' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint32_array' mangled-name='fnvlist_lookup_uint32_array' filepath='../../module/nvpair/fnvpair.c' line='471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint32_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='471' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='471' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/fnvpair.c' line='471' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int32_array' mangled-name='fnvlist_lookup_int32_array' filepath='../../module/nvpair/fnvpair.c' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int32_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/fnvpair.c' line='463' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint16_array' mangled-name='fnvlist_lookup_uint16_array' filepath='../../module/nvpair/fnvpair.c' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint16_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='455' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='455' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/fnvpair.c' line='455' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int16_array' mangled-name='fnvlist_lookup_int16_array' filepath='../../module/nvpair/fnvpair.c' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int16_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='447' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='447' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/fnvpair.c' line='447' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint8_array' mangled-name='fnvlist_lookup_uint8_array' filepath='../../module/nvpair/fnvpair.c' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint8_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/fnvpair.c' line='439' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int8_array' mangled-name='fnvlist_lookup_int8_array' filepath='../../module/nvpair/fnvpair.c' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int8_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/fnvpair.c' line='431' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_byte_array' mangled-name='fnvlist_lookup_byte_array' filepath='../../module/nvpair/fnvpair.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_byte_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='423' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='423' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/fnvpair.c' line='423' column='1'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_array' mangled-name='fnvlist_lookup_boolean_array' filepath='../../module/nvpair/fnvpair.c' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='415' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='415' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/fnvpair.c' line='415' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' mangled-name='fnvlist_lookup_nvlist' filepath='../../module/nvpair/fnvpair.c' line='408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_nvlist'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='408' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='408' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' mangled-name='fnvlist_lookup_string' filepath='../../module/nvpair/fnvpair.c' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_string'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='400' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='400' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64' mangled-name='fnvlist_lookup_uint64' filepath='../../module/nvpair/fnvpair.c' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint64'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='392' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='392' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint32' mangled-name='fnvlist_lookup_uint32' filepath='../../module/nvpair/fnvpair.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint32'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='384' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='384' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint16' mangled-name='fnvlist_lookup_uint16' filepath='../../module/nvpair/fnvpair.c' line='376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint16'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='376' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='376' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint8' mangled-name='fnvlist_lookup_uint8' filepath='../../module/nvpair/fnvpair.c' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint8'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='368' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='368' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int64' mangled-name='fnvlist_lookup_int64' filepath='../../module/nvpair/fnvpair.c' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int64'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='360' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='360' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int32' mangled-name='fnvlist_lookup_int32' filepath='../../module/nvpair/fnvpair.c' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int32'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='352' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='352' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int16' mangled-name='fnvlist_lookup_int16' filepath='../../module/nvpair/fnvpair.c' line='344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int16'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='344' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='344' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int8' mangled-name='fnvlist_lookup_int8' filepath='../../module/nvpair/fnvpair.c' line='336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int8'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='336' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='336' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_byte' mangled-name='fnvlist_lookup_byte' filepath='../../module/nvpair/fnvpair.c' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_byte'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='328' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='328' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_value' mangled-name='fnvlist_lookup_boolean_value' filepath='../../module/nvpair/fnvpair.c' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean_value'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='320' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='320' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean' mangled-name='fnvlist_lookup_boolean' filepath='../../module/nvpair/fnvpair.c' line='314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='314' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='314' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvpair' mangled-name='fnvlist_lookup_nvpair' filepath='../../module/nvpair/fnvpair.c' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_nvpair'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='305' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='305' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_remove_nvpair' mangled-name='fnvlist_remove_nvpair' filepath='../../module/nvpair/fnvpair.c' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_remove_nvpair'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='299' column='1'/>
      <parameter type-id='type-id-1' name='pair' filepath='../../module/nvpair/fnvpair.c' line='299' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_remove' mangled-name='fnvlist_remove' filepath='../../module/nvpair/fnvpair.c' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_remove'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='293' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='293' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist_array' mangled-name='fnvlist_add_nvlist_array' filepath='../../module/nvpair/fnvpair.c' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvlist_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='286' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='286' column='1'/>
      <parameter type-id='type-id-27' name='val' filepath='../../module/nvpair/fnvpair.c' line='287' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/fnvpair.c' line='287' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_string_array' mangled-name='fnvlist_add_string_array' filepath='../../module/nvpair/fnvpair.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_string_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='279' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='279' column='1'/>
      <parameter type-id='type-id-29' name='val' filepath='../../module/nvpair/fnvpair.c' line='280' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/fnvpair.c' line='280' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64_array' mangled-name='fnvlist_add_uint64_array' filepath='../../module/nvpair/fnvpair.c' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint64_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='272' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='272' column='1'/>
      <parameter type-id='type-id-16' name='val' filepath='../../module/nvpair/fnvpair.c' line='273' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/fnvpair.c' line='273' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_int64_array' mangled-name='fnvlist_add_int64_array' filepath='../../module/nvpair/fnvpair.c' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int64_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <parameter type-id='type-id-17' name='val' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint32_array' mangled-name='fnvlist_add_uint32_array' filepath='../../module/nvpair/fnvpair.c' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint32_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='259' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='259' column='1'/>
      <parameter type-id='type-id-18' name='val' filepath='../../module/nvpair/fnvpair.c' line='260' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/fnvpair.c' line='260' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32_array' mangled-name='fnvlist_add_int32_array' filepath='../../module/nvpair/fnvpair.c' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int32_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <parameter type-id='type-id-19' name='val' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint16_array' mangled-name='fnvlist_add_uint16_array' filepath='../../module/nvpair/fnvpair.c' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint16_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='246' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='246' column='1'/>
      <parameter type-id='type-id-20' name='val' filepath='../../module/nvpair/fnvpair.c' line='247' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/fnvpair.c' line='247' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_int16_array' mangled-name='fnvlist_add_int16_array' filepath='../../module/nvpair/fnvpair.c' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int16_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <parameter type-id='type-id-21' name='val' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8_array' mangled-name='fnvlist_add_uint8_array' filepath='../../module/nvpair/fnvpair.c' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint8_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <parameter type-id='type-id-22' name='val' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_int8_array' mangled-name='fnvlist_add_int8_array' filepath='../../module/nvpair/fnvpair.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int8_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <parameter type-id='type-id-23' name='val' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte_array' mangled-name='fnvlist_add_byte_array' filepath='../../module/nvpair/fnvpair.c' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_byte_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <parameter type-id='type-id-24' name='val' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_array' mangled-name='fnvlist_add_boolean_array' filepath='../../module/nvpair/fnvpair.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='215' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='215' column='1'/>
      <parameter type-id='type-id-25' name='val' filepath='../../module/nvpair/fnvpair.c' line='216' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/fnvpair.c' line='216' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvpair' mangled-name='fnvlist_add_nvpair' filepath='../../module/nvpair/fnvpair.c' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvpair'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='209' column='1'/>
      <parameter type-id='type-id-1' name='pair' filepath='../../module/nvpair/fnvpair.c' line='209' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' mangled-name='fnvlist_add_nvlist' filepath='../../module/nvpair/fnvpair.c' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvlist'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='203' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='203' column='1'/>
      <parameter type-id='type-id-2' name='val' filepath='../../module/nvpair/fnvpair.c' line='203' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' mangled-name='fnvlist_add_string' filepath='../../module/nvpair/fnvpair.c' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_string'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='197' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='197' column='1'/>
      <parameter type-id='type-id-14' name='val' filepath='../../module/nvpair/fnvpair.c' line='197' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' mangled-name='fnvlist_add_uint64' filepath='../../module/nvpair/fnvpair.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint64'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='191' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='191' column='1'/>
      <parameter type-id='type-id-4' name='val' filepath='../../module/nvpair/fnvpair.c' line='191' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_int64' mangled-name='fnvlist_add_int64' filepath='../../module/nvpair/fnvpair.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int64'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='185' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='185' column='1'/>
      <parameter type-id='type-id-8' name='val' filepath='../../module/nvpair/fnvpair.c' line='185' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint32' mangled-name='fnvlist_add_uint32' filepath='../../module/nvpair/fnvpair.c' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint32'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='179' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='179' column='1'/>
      <parameter type-id='type-id-5' name='val' filepath='../../module/nvpair/fnvpair.c' line='179' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32' mangled-name='fnvlist_add_int32' filepath='../../module/nvpair/fnvpair.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int32'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='173' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='173' column='1'/>
      <parameter type-id='type-id-9' name='val' filepath='../../module/nvpair/fnvpair.c' line='173' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint16' mangled-name='fnvlist_add_uint16' filepath='../../module/nvpair/fnvpair.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint16'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='167' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='167' column='1'/>
      <parameter type-id='type-id-6' name='val' filepath='../../module/nvpair/fnvpair.c' line='167' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_int16' mangled-name='fnvlist_add_int16' filepath='../../module/nvpair/fnvpair.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int16'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='161' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='161' column='1'/>
      <parameter type-id='type-id-10' name='val' filepath='../../module/nvpair/fnvpair.c' line='161' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8' mangled-name='fnvlist_add_uint8' filepath='../../module/nvpair/fnvpair.c' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint8'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='155' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='155' column='1'/>
      <parameter type-id='type-id-7' name='val' filepath='../../module/nvpair/fnvpair.c' line='155' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_int8' mangled-name='fnvlist_add_int8' filepath='../../module/nvpair/fnvpair.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int8'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='149' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='149' column='1'/>
      <parameter type-id='type-id-11' name='val' filepath='../../module/nvpair/fnvpair.c' line='149' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte' mangled-name='fnvlist_add_byte' filepath='../../module/nvpair/fnvpair.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_byte'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='143' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='143' column='1'/>
      <parameter type-id='type-id-12' name='val' filepath='../../module/nvpair/fnvpair.c' line='143' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_value' mangled-name='fnvlist_add_boolean_value' filepath='../../module/nvpair/fnvpair.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean_value'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='137' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='137' column='1'/>
      <parameter type-id='type-id-13' name='val' filepath='../../module/nvpair/fnvpair.c' line='137' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' mangled-name='fnvlist_add_boolean' filepath='../../module/nvpair/fnvpair.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='131' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/fnvpair.c' line='131' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_num_pairs' mangled-name='fnvlist_num_pairs' filepath='../../module/nvpair/fnvpair.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_num_pairs'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='119' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fnvlist_merge' mangled-name='fnvlist_merge' filepath='../../module/nvpair/fnvpair.c' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_merge'>
      <parameter type-id='type-id-2' name='dst' filepath='../../module/nvpair/fnvpair.c' line='113' column='1'/>
      <parameter type-id='type-id-2' name='src' filepath='../../module/nvpair/fnvpair.c' line='113' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_dup' mangled-name='fnvlist_dup' filepath='../../module/nvpair/fnvpair.c' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_dup'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='105' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_unpack' mangled-name='fnvlist_unpack' filepath='../../module/nvpair/fnvpair.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_unpack'>
      <parameter type-id='type-id-3' name='buf' filepath='../../module/nvpair/fnvpair.c' line='97' column='1'/>
      <parameter type-id='type-id-30' name='buflen' filepath='../../module/nvpair/fnvpair.c' line='97' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_pack_free' mangled-name='fnvlist_pack_free' filepath='../../module/nvpair/fnvpair.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_pack_free'>
      <parameter type-id='type-id-3' name='pack' filepath='../../module/nvpair/fnvpair.c' line='87' column='1'/>
      <parameter type-id='type-id-30' name='size' filepath='../../module/nvpair/fnvpair.c' line='87' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_pack' mangled-name='fnvlist_pack' filepath='../../module/nvpair/fnvpair.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_pack'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='77' column='1'/>
      <parameter type-id='type-id-31' name='sizep' filepath='../../module/nvpair/fnvpair.c' line='77' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='fnvlist_size' mangled-name='fnvlist_size' filepath='../../module/nvpair/fnvpair.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_size'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='65' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='fnvlist_free' mangled-name='fnvlist_free' filepath='../../module/nvpair/fnvpair.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_free'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='59' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_alloc' mangled-name='fnvlist_alloc' filepath='../../module/nvpair/fnvpair.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_alloc'>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64_array' mangled-name='nvlist_lookup_uint64_array' filepath='../../include/sys/nvpair.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64_array' mangled-name='nvlist_lookup_int64_array' filepath='../../include/sys/nvpair.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint32_array' mangled-name='nvlist_lookup_uint32_array' filepath='../../include/sys/nvpair.h' line='223' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int32_array' mangled-name='nvlist_lookup_int32_array' filepath='../../include/sys/nvpair.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint16_array' mangled-name='nvlist_lookup_uint16_array' filepath='../../include/sys/nvpair.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int16_array' mangled-name='nvlist_lookup_int16_array' filepath='../../include/sys/nvpair.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint8_array' mangled-name='nvlist_lookup_uint8_array' filepath='../../include/sys/nvpair.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int8_array' mangled-name='nvlist_lookup_int8_array' filepath='../../include/sys/nvpair.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_byte_array' mangled-name='nvlist_lookup_byte_array' filepath='../../include/sys/nvpair.h' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean_array' mangled-name='nvlist_lookup_boolean_array' filepath='../../include/sys/nvpair.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' mangled-name='nvlist_lookup_nvlist' filepath='../../include/sys/nvpair.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' mangled-name='nvlist_lookup_string' filepath='../../include/sys/nvpair.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' mangled-name='nvlist_lookup_uint64' filepath='../../include/sys/nvpair.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint32' mangled-name='nvlist_lookup_uint32' filepath='../../include/sys/nvpair.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint16' mangled-name='nvlist_lookup_uint16' filepath='../../include/sys/nvpair.h' line='208' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint8' mangled-name='nvlist_lookup_uint8' filepath='../../include/sys/nvpair.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64' mangled-name='nvlist_lookup_int64' filepath='../../include/sys/nvpair.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int32' mangled-name='nvlist_lookup_int32' filepath='../../include/sys/nvpair.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int16' mangled-name='nvlist_lookup_int16' filepath='../../include/sys/nvpair.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int8' mangled-name='nvlist_lookup_int8' filepath='../../include/sys/nvpair.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_byte' mangled-name='nvlist_lookup_byte' filepath='../../include/sys/nvpair.h' line='204' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean_value' mangled-name='nvlist_lookup_boolean_value' filepath='../../include/sys/nvpair.h' line='203' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean' mangled-name='nvlist_lookup_boolean' filepath='../../include/sys/nvpair.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvpair' mangled-name='nvlist_lookup_nvpair' filepath='../../include/sys/nvpair.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_remove_nvpair' mangled-name='nvlist_remove_nvpair' filepath='../../include/sys/nvpair.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' mangled-name='nvlist_remove_all' filepath='../../include/sys/nvpair.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' mangled-name='nvlist_add_nvlist_array' filepath='../../include/sys/nvpair.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_string_array' mangled-name='nvlist_add_string_array' filepath='../../include/sys/nvpair.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' mangled-name='nvlist_add_uint64_array' filepath='../../include/sys/nvpair.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_int64_array' mangled-name='nvlist_add_int64_array' filepath='../../include/sys/nvpair.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32_array' mangled-name='nvlist_add_uint32_array' filepath='../../include/sys/nvpair.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_int32_array' mangled-name='nvlist_add_int32_array' filepath='../../include/sys/nvpair.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16_array' mangled-name='nvlist_add_uint16_array' filepath='../../include/sys/nvpair.h' line='186' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_int16_array' mangled-name='nvlist_add_int16_array' filepath='../../include/sys/nvpair.h' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8_array' mangled-name='nvlist_add_uint8_array' filepath='../../include/sys/nvpair.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_int8_array' mangled-name='nvlist_add_int8_array' filepath='../../include/sys/nvpair.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_byte_array' mangled-name='nvlist_add_byte_array' filepath='../../include/sys/nvpair.h' line='182' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_array' mangled-name='nvlist_add_boolean_array' filepath='../../include/sys/nvpair.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_nvpair' mangled-name='nvlist_add_nvpair' filepath='../../include/sys/nvpair.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' mangled-name='nvlist_add_nvlist' filepath='../../include/sys/nvpair.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_string' mangled-name='nvlist_add_string' filepath='../../include/sys/nvpair.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' mangled-name='nvlist_add_uint64' filepath='../../include/sys/nvpair.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_int64' mangled-name='nvlist_add_int64' filepath='../../include/sys/nvpair.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32' mangled-name='nvlist_add_uint32' filepath='../../include/sys/nvpair.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_int32' mangled-name='nvlist_add_int32' filepath='../../include/sys/nvpair.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16' mangled-name='nvlist_add_uint16' filepath='../../include/sys/nvpair.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_int16' mangled-name='nvlist_add_int16' filepath='../../include/sys/nvpair.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8' mangled-name='nvlist_add_uint8' filepath='../../include/sys/nvpair.h' line='172' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_int8' mangled-name='nvlist_add_int8' filepath='../../include/sys/nvpair.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_byte' mangled-name='nvlist_add_byte' filepath='../../include/sys/nvpair.h' line='170' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_value' mangled-name='nvlist_add_boolean_value' filepath='../../include/sys/nvpair.h' line='169' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean' mangled-name='nvlist_add_boolean' filepath='../../include/sys/nvpair.h' line='168' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_merge' mangled-name='nvlist_merge' filepath='../../include/sys/nvpair.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_dup' mangled-name='nvlist_dup' filepath='../../include/sys/nvpair.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_unpack' mangled-name='nvlist_unpack' filepath='../../include/sys/nvpair.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_pack' mangled-name='nvlist_pack' filepath='../../include/sys/nvpair.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_size' mangled-name='nvlist_size' filepath='../../include/sys/nvpair.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_free' mangled-name='nvlist_free' filepath='../../include/sys/nvpair.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_alloc' mangled-name='nvlist_alloc' filepath='../../include/sys/nvpair.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-3'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-31'/>
    <typedef-decl name='boolean_t' type-id='type-id-37' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-13'/>
    <typedef-decl name='int16_t' type-id='type-id-38' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='25' column='1' id='type-id-10'/>
    <typedef-decl name='int32_t' type-id='type-id-39' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-9'/>
    <typedef-decl name='int64_t' type-id='type-id-40' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-8'/>
    <typedef-decl name='int8_t' type-id='type-id-41' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='24' column='1' id='type-id-11'/>
    <typedef-decl name='size_t' type-id='type-id-42' filepath='/usr/lib/gcc/x86_64-linux-gnu/10/include/stddef.h' line='209' column='1' id='type-id-30'/>
    <typedef-decl name='uchar_t' type-id='type-id-43' filepath='../../lib/libspl/include/sys/stdtypes.h' line='31' column='1' id='type-id-12'/>
    <typedef-decl name='uint16_t' type-id='type-id-44' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='25' column='1' id='type-id-6'/>
    <typedef-decl name='uint32_t' type-id='type-id-45' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-5'/>
    <typedef-decl name='uint64_t' type-id='type-id-46' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-4'/>
    <typedef-decl name='uint8_t' type-id='type-id-47' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-7'/>
    <typedef-decl name='uint_t' type-id='type-id-48' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-28'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-15'/>
    <type-decl name='void' id='type-id-26'/>
    <type-decl name='char' size-in-bits='8' id='type-id-32'/>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-33'/>
    <qualified-type-def type-id='type-id-32' const='yes' id='type-id-34'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-37'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <typedef-decl name='__int16_t' type-id='type-id-50' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='39' column='1' id='type-id-38'/>
    <typedef-decl name='__int32_t' type-id='type-id-51' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-39'/>
    <typedef-decl name='__int64_t' type-id='type-id-52' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-40'/>
    <typedef-decl name='__int8_t' type-id='type-id-53' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='37' column='1' id='type-id-41'/>
    <typedef-decl name='__uint16_t' type-id='type-id-54' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-44'/>
    <typedef-decl name='__uint32_t' type-id='type-id-48' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-45'/>
    <typedef-decl name='__uint64_t' type-id='type-id-42' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-46'/>
    <typedef-decl name='__uint8_t' type-id='type-id-43' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-47'/>
    <typedef-decl name='nvlist_t' type-id='type-id-55' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-35'/>
    <typedef-decl name='nvpair_t' type-id='type-id-56' filepath='../../include/sys/nvpair.h' line='82' column='1' id='type-id-36'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-43'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-48'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-42'/>
    <type-decl name='int' size-in-bits='32' id='type-id-51'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-52'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-50'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-53'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-9' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-5' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-4' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-5' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-9' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='73' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-9' visibility='default' filepath='../../include/sys/nvpair.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-10' visibility='default' filepath='../../include/sys/nvpair.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-10' visibility='default' filepath='../../include/sys/nvpair.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-9' visibility='default' filepath='../../include/sys/nvpair.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-57' visibility='default' filepath='../../include/sys/nvpair.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-54'/>
    <typedef-decl name='data_type_t' type-id='type-id-58' filepath='../../include/sys/nvpair.h' line='71' column='1' id='type-id-57'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/nvpair.h' line='37' column='1' id='type-id-58'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/nvpair.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libnvpair' language='LANG_C99'>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-59'/>
    <qualified-type-def type-id='type-id-3' const='yes' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-63'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-69'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-70'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-71'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-72'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-31'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-15'/>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <var-decl name='nvpair_max_recursion' type-id='type-id-51' mangled-name='nvpair_max_recursion' visibility='default' filepath='../../module/nvpair/nvpair.c' line='151' column='1' elf-symbol-id='nvpair_max_recursion'/>
    <var-decl name='nvlist_hashtable_init_size' type-id='type-id-4' mangled-name='nvlist_hashtable_init_size' visibility='default' filepath='../../module/nvpair/nvpair.c' line='154' column='1' elf-symbol-id='nvlist_hashtable_init_size'/>
    <function-decl name='nvlist_xunpack' mangled-name='nvlist_xunpack' filepath='../../module/nvpair/nvpair.c' line='2721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xunpack'>
      <parameter type-id='type-id-3' name='buf' filepath='../../module/nvpair/nvpair.c' line='2721' column='1'/>
      <parameter type-id='type-id-30' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2721' column='1'/>
      <parameter type-id='type-id-27' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='2721' column='1'/>
      <parameter type-id='type-id-78' name='nva' filepath='../../module/nvpair/nvpair.c' line='2721' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_unpack' mangled-name='nvlist_unpack' filepath='../../module/nvpair/nvpair.c' line='2715' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_unpack'>
      <parameter type-id='type-id-3' name='buf' filepath='../../module/nvpair/nvpair.c' line='2715' column='1'/>
      <parameter type-id='type-id-30' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2715' column='1'/>
      <parameter type-id='type-id-27' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='2715' column='1'/>
      <parameter type-id='type-id-51' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='2715' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_pack' mangled-name='nvlist_pack' filepath='../../module/nvpair/nvpair.c' line='2657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_pack'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2657' column='1'/>
      <parameter type-id='type-id-60' name='bufp' filepath='../../module/nvpair/nvpair.c' line='2657' column='1'/>
      <parameter type-id='type-id-31' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2657' column='1'/>
      <parameter type-id='type-id-51' name='encoding' filepath='../../module/nvpair/nvpair.c' line='2657' column='1'/>
      <parameter type-id='type-id-51' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='2658' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_size' mangled-name='nvlist_size' filepath='../../module/nvpair/nvpair.c' line='2648' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_size'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2648' column='1'/>
      <parameter type-id='type-id-31' name='size' filepath='../../module/nvpair/nvpair.c' line='2648' column='1'/>
      <parameter type-id='type-id-51' name='encoding' filepath='../../module/nvpair/nvpair.c' line='2648' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_merge' mangled-name='nvlist_merge' filepath='../../module/nvpair/nvpair.c' line='2279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_merge'>
      <parameter type-id='type-id-2' name='dst' filepath='../../module/nvpair/nvpair.c' line='2279' column='1'/>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2279' column='1'/>
      <parameter type-id='type-id-51' name='flag' filepath='../../module/nvpair/nvpair.c' line='2279' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_nvpair' mangled-name='nvlist_add_nvpair' filepath='../../module/nvpair/nvpair.c' line='2262' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvpair'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2262' column='1'/>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2262' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_hrtime' mangled-name='nvpair_value_hrtime' filepath='../../module/nvpair/nvpair.c' line='2253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_hrtime'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2253' column='1'/>
      <parameter type-id='type-id-65' name='val' filepath='../../module/nvpair/nvpair.c' line='2253' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist_array' mangled-name='nvpair_value_nvlist_array' filepath='../../module/nvpair/nvpair.c' line='2247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist_array'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2247' column='1'/>
      <parameter type-id='type-id-71' name='val' filepath='../../module/nvpair/nvpair.c' line='2247' column='1'/>
      <parameter type-id='type-id-15' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2247' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_string_array' mangled-name='nvpair_value_string_array' filepath='../../module/nvpair/nvpair.c' line='2241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string_array'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2241' column='1'/>
      <parameter type-id='type-id-61' name='val' filepath='../../module/nvpair/nvpair.c' line='2241' column='1'/>
      <parameter type-id='type-id-15' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2241' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64_array' mangled-name='nvpair_value_uint64_array' filepath='../../module/nvpair/nvpair.c' line='2235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64_array'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2235' column='1'/>
      <parameter type-id='type-id-76' name='val' filepath='../../module/nvpair/nvpair.c' line='2235' column='1'/>
      <parameter type-id='type-id-15' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2235' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_int64_array' mangled-name='nvpair_value_int64_array' filepath='../../module/nvpair/nvpair.c' line='2229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64_array'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2229' column='1'/>
      <parameter type-id='type-id-69' name='val' filepath='../../module/nvpair/nvpair.c' line='2229' column='1'/>
      <parameter type-id='type-id-15' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2229' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32_array' mangled-name='nvpair_value_uint32_array' filepath='../../module/nvpair/nvpair.c' line='2223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32_array'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2223' column='1'/>
      <parameter type-id='type-id-75' name='val' filepath='../../module/nvpair/nvpair.c' line='2223' column='1'/>
      <parameter type-id='type-id-15' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2223' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_int32_array' mangled-name='nvpair_value_int32_array' filepath='../../module/nvpair/nvpair.c' line='2217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32_array'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2217' column='1'/>
      <parameter type-id='type-id-68' name='val' filepath='../../module/nvpair/nvpair.c' line='2217' column='1'/>
      <parameter type-id='type-id-15' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2217' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16_array' mangled-name='nvpair_value_uint16_array' filepath='../../module/nvpair/nvpair.c' line='2211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16_array'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2211' column='1'/>
      <parameter type-id='type-id-74' name='val' filepath='../../module/nvpair/nvpair.c' line='2211' column='1'/>
      <parameter type-id='type-id-15' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2211' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_int16_array' mangled-name='nvpair_value_int16_array' filepath='../../module/nvpair/nvpair.c' line='2205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16_array'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2205' column='1'/>
      <parameter type-id='type-id-67' name='val' filepath='../../module/nvpair/nvpair.c' line='2205' column='1'/>
      <parameter type-id='type-id-15' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2205' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8_array' mangled-name='nvpair_value_uint8_array' filepath='../../module/nvpair/nvpair.c' line='2199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8_array'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2199' column='1'/>
      <parameter type-id='type-id-77' name='val' filepath='../../module/nvpair/nvpair.c' line='2199' column='1'/>
      <parameter type-id='type-id-15' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2199' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_int8_array' mangled-name='nvpair_value_int8_array' filepath='../../module/nvpair/nvpair.c' line='2193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8_array'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2193' column='1'/>
      <parameter type-id='type-id-70' name='val' filepath='../../module/nvpair/nvpair.c' line='2193' column='1'/>
      <parameter type-id='type-id-15' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2193' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_byte_array' mangled-name='nvpair_value_byte_array' filepath='../../module/nvpair/nvpair.c' line='2187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte_array'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2187' column='1'/>
      <parameter type-id='type-id-73' name='val' filepath='../../module/nvpair/nvpair.c' line='2187' column='1'/>
      <parameter type-id='type-id-15' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2187' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_array' mangled-name='nvpair_value_boolean_array' filepath='../../module/nvpair/nvpair.c' line='2181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_array'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2181' column='1'/>
      <parameter type-id='type-id-59' name='val' filepath='../../module/nvpair/nvpair.c' line='2181' column='1'/>
      <parameter type-id='type-id-15' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2181' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' filepath='../../module/nvpair/nvpair.c' line='2175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2175' column='1'/>
      <parameter type-id='type-id-27' name='val' filepath='../../module/nvpair/nvpair.c' line='2175' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_string' mangled-name='nvpair_value_string' filepath='../../module/nvpair/nvpair.c' line='2169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2169' column='1'/>
      <parameter type-id='type-id-60' name='val' filepath='../../module/nvpair/nvpair.c' line='2169' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_double' mangled-name='nvpair_value_double' filepath='../../module/nvpair/nvpair.c' line='2162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_double'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2162' column='1'/>
      <parameter type-id='type-id-63' name='val' filepath='../../module/nvpair/nvpair.c' line='2162' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' mangled-name='nvpair_value_uint64' filepath='../../module/nvpair/nvpair.c' line='2155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2155' column='1'/>
      <parameter type-id='type-id-16' name='val' filepath='../../module/nvpair/nvpair.c' line='2155' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_int64' mangled-name='nvpair_value_int64' filepath='../../module/nvpair/nvpair.c' line='2149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2149' column='1'/>
      <parameter type-id='type-id-17' name='val' filepath='../../module/nvpair/nvpair.c' line='2149' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32' mangled-name='nvpair_value_uint32' filepath='../../module/nvpair/nvpair.c' line='2143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2143' column='1'/>
      <parameter type-id='type-id-18' name='val' filepath='../../module/nvpair/nvpair.c' line='2143' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_int32' mangled-name='nvpair_value_int32' filepath='../../module/nvpair/nvpair.c' line='2137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2137' column='1'/>
      <parameter type-id='type-id-19' name='val' filepath='../../module/nvpair/nvpair.c' line='2137' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16' mangled-name='nvpair_value_uint16' filepath='../../module/nvpair/nvpair.c' line='2131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2131' column='1'/>
      <parameter type-id='type-id-20' name='val' filepath='../../module/nvpair/nvpair.c' line='2131' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_int16' mangled-name='nvpair_value_int16' filepath='../../module/nvpair/nvpair.c' line='2125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2125' column='1'/>
      <parameter type-id='type-id-21' name='val' filepath='../../module/nvpair/nvpair.c' line='2125' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8' mangled-name='nvpair_value_uint8' filepath='../../module/nvpair/nvpair.c' line='2119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2119' column='1'/>
      <parameter type-id='type-id-22' name='val' filepath='../../module/nvpair/nvpair.c' line='2119' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_int8' mangled-name='nvpair_value_int8' filepath='../../module/nvpair/nvpair.c' line='2113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2113' column='1'/>
      <parameter type-id='type-id-23' name='val' filepath='../../module/nvpair/nvpair.c' line='2113' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_byte' mangled-name='nvpair_value_byte' filepath='../../module/nvpair/nvpair.c' line='2107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2107' column='1'/>
      <parameter type-id='type-id-24' name='val' filepath='../../module/nvpair/nvpair.c' line='2107' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_value' mangled-name='nvpair_value_boolean_value' filepath='../../module/nvpair/nvpair.c' line='2101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_value'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2101' column='1'/>
      <parameter type-id='type-id-25' name='val' filepath='../../module/nvpair/nvpair.c' line='2101' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_exists' mangled-name='nvlist_exists' filepath='../../module/nvpair/nvpair.c' line='2080' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_exists'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2080' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='2080' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvpair_embedded_index' mangled-name='nvlist_lookup_nvpair_embedded_index' filepath='../../module/nvpair/nvpair.c' line='2073' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvpair_embedded_index'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2073' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='2074' column='1'/>
      <parameter type-id='type-id-72' name='ret' filepath='../../module/nvpair/nvpair.c' line='2074' column='1'/>
      <parameter type-id='type-id-66' name='ip' filepath='../../module/nvpair/nvpair.c' line='2074' column='1'/>
      <parameter type-id='type-id-60' name='ep' filepath='../../module/nvpair/nvpair.c' line='2074' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvpair' mangled-name='nvlist_lookup_nvpair' filepath='../../module/nvpair/nvpair.c' line='2063' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvpair'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2063' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='2063' column='1'/>
      <parameter type-id='type-id-72' name='ret' filepath='../../module/nvpair/nvpair.c' line='2063' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_pairs' mangled-name='nvlist_lookup_pairs' filepath='../../module/nvpair/nvpair.c' line='1813' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_pairs'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1813' column='1'/>
      <parameter type-id='type-id-51' name='flag' filepath='../../module/nvpair/nvpair.c' line='1813' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_hrtime' mangled-name='nvlist_lookup_hrtime' filepath='../../module/nvpair/nvpair.c' line='1807' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_hrtime'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1807' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1807' column='1'/>
      <parameter type-id='type-id-65' name='val' filepath='../../module/nvpair/nvpair.c' line='1807' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist_array' mangled-name='nvlist_lookup_nvlist_array' filepath='../../module/nvpair/nvpair.c' line='1800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvlist_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1800' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1800' column='1'/>
      <parameter type-id='type-id-71' name='a' filepath='../../module/nvpair/nvpair.c' line='1801' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/nvpair.c' line='1801' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string_array' mangled-name='nvlist_lookup_string_array' filepath='../../module/nvpair/nvpair.c' line='1793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_string_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1793' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1793' column='1'/>
      <parameter type-id='type-id-61' name='a' filepath='../../module/nvpair/nvpair.c' line='1794' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/nvpair.c' line='1794' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64_array' mangled-name='nvlist_lookup_uint64_array' filepath='../../module/nvpair/nvpair.c' line='1786' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint64_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1786' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1786' column='1'/>
      <parameter type-id='type-id-76' name='a' filepath='../../module/nvpair/nvpair.c' line='1787' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/nvpair.c' line='1787' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64_array' mangled-name='nvlist_lookup_int64_array' filepath='../../module/nvpair/nvpair.c' line='1779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int64_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1779' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1779' column='1'/>
      <parameter type-id='type-id-69' name='a' filepath='../../module/nvpair/nvpair.c' line='1780' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/nvpair.c' line='1780' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint32_array' mangled-name='nvlist_lookup_uint32_array' filepath='../../module/nvpair/nvpair.c' line='1772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint32_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1772' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1772' column='1'/>
      <parameter type-id='type-id-75' name='a' filepath='../../module/nvpair/nvpair.c' line='1773' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/nvpair.c' line='1773' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int32_array' mangled-name='nvlist_lookup_int32_array' filepath='../../module/nvpair/nvpair.c' line='1765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int32_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1765' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1765' column='1'/>
      <parameter type-id='type-id-68' name='a' filepath='../../module/nvpair/nvpair.c' line='1766' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/nvpair.c' line='1766' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint16_array' mangled-name='nvlist_lookup_uint16_array' filepath='../../module/nvpair/nvpair.c' line='1758' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint16_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1758' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1758' column='1'/>
      <parameter type-id='type-id-74' name='a' filepath='../../module/nvpair/nvpair.c' line='1759' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/nvpair.c' line='1759' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int16_array' mangled-name='nvlist_lookup_int16_array' filepath='../../module/nvpair/nvpair.c' line='1751' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int16_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1751' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1751' column='1'/>
      <parameter type-id='type-id-67' name='a' filepath='../../module/nvpair/nvpair.c' line='1752' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/nvpair.c' line='1752' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint8_array' mangled-name='nvlist_lookup_uint8_array' filepath='../../module/nvpair/nvpair.c' line='1744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint8_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1744' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1744' column='1'/>
      <parameter type-id='type-id-77' name='a' filepath='../../module/nvpair/nvpair.c' line='1745' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/nvpair.c' line='1745' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int8_array' mangled-name='nvlist_lookup_int8_array' filepath='../../module/nvpair/nvpair.c' line='1738' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int8_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1738' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1738' column='1'/>
      <parameter type-id='type-id-70' name='a' filepath='../../module/nvpair/nvpair.c' line='1738' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/nvpair.c' line='1738' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_byte_array' mangled-name='nvlist_lookup_byte_array' filepath='../../module/nvpair/nvpair.c' line='1731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_byte_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1731' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1731' column='1'/>
      <parameter type-id='type-id-73' name='a' filepath='../../module/nvpair/nvpair.c' line='1732' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/nvpair.c' line='1732' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean_array' mangled-name='nvlist_lookup_boolean_array' filepath='../../module/nvpair/nvpair.c' line='1723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1723' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1723' column='1'/>
      <parameter type-id='type-id-59' name='a' filepath='../../module/nvpair/nvpair.c' line='1724' column='1'/>
      <parameter type-id='type-id-15' name='n' filepath='../../module/nvpair/nvpair.c' line='1724' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' mangled-name='nvlist_lookup_nvlist' filepath='../../module/nvpair/nvpair.c' line='1717' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvlist'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1717' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1717' column='1'/>
      <parameter type-id='type-id-27' name='val' filepath='../../module/nvpair/nvpair.c' line='1717' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' mangled-name='nvlist_lookup_string' filepath='../../module/nvpair/nvpair.c' line='1711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_string'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1711' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1711' column='1'/>
      <parameter type-id='type-id-60' name='val' filepath='../../module/nvpair/nvpair.c' line='1711' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_double' mangled-name='nvlist_lookup_double' filepath='../../module/nvpair/nvpair.c' line='1704' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_double'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1704' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1704' column='1'/>
      <parameter type-id='type-id-63' name='val' filepath='../../module/nvpair/nvpair.c' line='1704' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' mangled-name='nvlist_lookup_uint64' filepath='../../module/nvpair/nvpair.c' line='1697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint64'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1697' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1697' column='1'/>
      <parameter type-id='type-id-16' name='val' filepath='../../module/nvpair/nvpair.c' line='1697' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64' mangled-name='nvlist_lookup_int64' filepath='../../module/nvpair/nvpair.c' line='1691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int64'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1691' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1691' column='1'/>
      <parameter type-id='type-id-17' name='val' filepath='../../module/nvpair/nvpair.c' line='1691' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint32' mangled-name='nvlist_lookup_uint32' filepath='../../module/nvpair/nvpair.c' line='1685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint32'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1685' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1685' column='1'/>
      <parameter type-id='type-id-18' name='val' filepath='../../module/nvpair/nvpair.c' line='1685' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int32' mangled-name='nvlist_lookup_int32' filepath='../../module/nvpair/nvpair.c' line='1679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int32'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1679' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1679' column='1'/>
      <parameter type-id='type-id-19' name='val' filepath='../../module/nvpair/nvpair.c' line='1679' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint16' mangled-name='nvlist_lookup_uint16' filepath='../../module/nvpair/nvpair.c' line='1673' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint16'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1673' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1673' column='1'/>
      <parameter type-id='type-id-20' name='val' filepath='../../module/nvpair/nvpair.c' line='1673' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int16' mangled-name='nvlist_lookup_int16' filepath='../../module/nvpair/nvpair.c' line='1667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int16'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1667' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1667' column='1'/>
      <parameter type-id='type-id-21' name='val' filepath='../../module/nvpair/nvpair.c' line='1667' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint8' mangled-name='nvlist_lookup_uint8' filepath='../../module/nvpair/nvpair.c' line='1661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint8'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1661' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1661' column='1'/>
      <parameter type-id='type-id-22' name='val' filepath='../../module/nvpair/nvpair.c' line='1661' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int8' mangled-name='nvlist_lookup_int8' filepath='../../module/nvpair/nvpair.c' line='1655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int8'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1655' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1655' column='1'/>
      <parameter type-id='type-id-23' name='val' filepath='../../module/nvpair/nvpair.c' line='1655' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_byte' mangled-name='nvlist_lookup_byte' filepath='../../module/nvpair/nvpair.c' line='1649' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_byte'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1649' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1649' column='1'/>
      <parameter type-id='type-id-24' name='val' filepath='../../module/nvpair/nvpair.c' line='1649' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean_value' mangled-name='nvlist_lookup_boolean_value' filepath='../../module/nvpair/nvpair.c' line='1642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean_value'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1642' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1642' column='1'/>
      <parameter type-id='type-id-25' name='val' filepath='../../module/nvpair/nvpair.c' line='1642' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean' mangled-name='nvlist_lookup_boolean' filepath='../../module/nvpair/nvpair.c' line='1636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1636' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1636' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_type_is_array' mangled-name='nvpair_type_is_array' filepath='../../module/nvpair/nvpair.c' line='1520' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type_is_array'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1520' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_type' mangled-name='nvpair_type' filepath='../../module/nvpair/nvpair.c' line='1514' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1514' column='1'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' filepath='../../module/nvpair/nvpair.c' line='1508' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_name'>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1508' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='nvlist_empty' mangled-name='nvlist_empty' filepath='../../module/nvpair/nvpair.c' line='1496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_empty'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1496' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='nvlist_prev_nvpair' mangled-name='nvlist_prev_nvpair' filepath='../../module/nvpair/nvpair.c' line='1472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prev_nvpair'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1472' column='1'/>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1472' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' filepath='../../module/nvpair/nvpair.c' line='1443' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_next_nvpair'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1443' column='1'/>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1443' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' mangled-name='nvlist_add_nvlist_array' filepath='../../module/nvpair/nvpair.c' line='1436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvlist_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1436' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1436' column='1'/>
      <parameter type-id='type-id-27' name='a' filepath='../../module/nvpair/nvpair.c' line='1436' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/nvpair.c' line='1436' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' mangled-name='nvlist_add_nvlist' filepath='../../module/nvpair/nvpair.c' line='1430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvlist'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1430' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1430' column='1'/>
      <parameter type-id='type-id-2' name='val' filepath='../../module/nvpair/nvpair.c' line='1430' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_hrtime' mangled-name='nvlist_add_hrtime' filepath='../../module/nvpair/nvpair.c' line='1424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_hrtime'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1424' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1424' column='1'/>
      <parameter type-id='type-id-64' name='val' filepath='../../module/nvpair/nvpair.c' line='1424' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_string_array' mangled-name='nvlist_add_string_array' filepath='../../module/nvpair/nvpair.c' line='1417' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_string_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1417' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1417' column='1'/>
      <parameter type-id='type-id-29' name='a' filepath='../../module/nvpair/nvpair.c' line='1418' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/nvpair.c' line='1418' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' mangled-name='nvlist_add_uint64_array' filepath='../../module/nvpair/nvpair.c' line='1411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint64_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1411' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1411' column='1'/>
      <parameter type-id='type-id-16' name='a' filepath='../../module/nvpair/nvpair.c' line='1411' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/nvpair.c' line='1411' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_int64_array' mangled-name='nvlist_add_int64_array' filepath='../../module/nvpair/nvpair.c' line='1405' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int64_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1405' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1405' column='1'/>
      <parameter type-id='type-id-17' name='a' filepath='../../module/nvpair/nvpair.c' line='1405' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/nvpair.c' line='1405' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32_array' mangled-name='nvlist_add_uint32_array' filepath='../../module/nvpair/nvpair.c' line='1399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint32_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1399' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1399' column='1'/>
      <parameter type-id='type-id-18' name='a' filepath='../../module/nvpair/nvpair.c' line='1399' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/nvpair.c' line='1399' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_int32_array' mangled-name='nvlist_add_int32_array' filepath='../../module/nvpair/nvpair.c' line='1393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int32_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1393' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1393' column='1'/>
      <parameter type-id='type-id-19' name='a' filepath='../../module/nvpair/nvpair.c' line='1393' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/nvpair.c' line='1393' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16_array' mangled-name='nvlist_add_uint16_array' filepath='../../module/nvpair/nvpair.c' line='1387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint16_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1387' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1387' column='1'/>
      <parameter type-id='type-id-20' name='a' filepath='../../module/nvpair/nvpair.c' line='1387' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/nvpair.c' line='1387' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_int16_array' mangled-name='nvlist_add_int16_array' filepath='../../module/nvpair/nvpair.c' line='1381' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int16_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1381' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1381' column='1'/>
      <parameter type-id='type-id-21' name='a' filepath='../../module/nvpair/nvpair.c' line='1381' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/nvpair.c' line='1381' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8_array' mangled-name='nvlist_add_uint8_array' filepath='../../module/nvpair/nvpair.c' line='1375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint8_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1375' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1375' column='1'/>
      <parameter type-id='type-id-22' name='a' filepath='../../module/nvpair/nvpair.c' line='1375' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/nvpair.c' line='1375' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_int8_array' mangled-name='nvlist_add_int8_array' filepath='../../module/nvpair/nvpair.c' line='1369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int8_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1369' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1369' column='1'/>
      <parameter type-id='type-id-23' name='a' filepath='../../module/nvpair/nvpair.c' line='1369' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/nvpair.c' line='1369' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_byte_array' mangled-name='nvlist_add_byte_array' filepath='../../module/nvpair/nvpair.c' line='1363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_byte_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1363' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1363' column='1'/>
      <parameter type-id='type-id-24' name='a' filepath='../../module/nvpair/nvpair.c' line='1363' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/nvpair.c' line='1363' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_array' mangled-name='nvlist_add_boolean_array' filepath='../../module/nvpair/nvpair.c' line='1356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean_array'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1356' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1356' column='1'/>
      <parameter type-id='type-id-25' name='a' filepath='../../module/nvpair/nvpair.c' line='1357' column='1'/>
      <parameter type-id='type-id-28' name='n' filepath='../../module/nvpair/nvpair.c' line='1357' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_string' mangled-name='nvlist_add_string' filepath='../../module/nvpair/nvpair.c' line='1350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_string'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1350' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1350' column='1'/>
      <parameter type-id='type-id-14' name='val' filepath='../../module/nvpair/nvpair.c' line='1350' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_double' mangled-name='nvlist_add_double' filepath='../../module/nvpair/nvpair.c' line='1343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_double'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1343' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1343' column='1'/>
      <parameter type-id='type-id-62' name='val' filepath='../../module/nvpair/nvpair.c' line='1343' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' mangled-name='nvlist_add_uint64' filepath='../../module/nvpair/nvpair.c' line='1336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint64'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1336' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1336' column='1'/>
      <parameter type-id='type-id-4' name='val' filepath='../../module/nvpair/nvpair.c' line='1336' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_int64' mangled-name='nvlist_add_int64' filepath='../../module/nvpair/nvpair.c' line='1330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int64'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1330' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1330' column='1'/>
      <parameter type-id='type-id-8' name='val' filepath='../../module/nvpair/nvpair.c' line='1330' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32' mangled-name='nvlist_add_uint32' filepath='../../module/nvpair/nvpair.c' line='1324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint32'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1324' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1324' column='1'/>
      <parameter type-id='type-id-5' name='val' filepath='../../module/nvpair/nvpair.c' line='1324' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_int32' mangled-name='nvlist_add_int32' filepath='../../module/nvpair/nvpair.c' line='1318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int32'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1318' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1318' column='1'/>
      <parameter type-id='type-id-9' name='val' filepath='../../module/nvpair/nvpair.c' line='1318' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16' mangled-name='nvlist_add_uint16' filepath='../../module/nvpair/nvpair.c' line='1312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint16'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1312' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1312' column='1'/>
      <parameter type-id='type-id-6' name='val' filepath='../../module/nvpair/nvpair.c' line='1312' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_int16' mangled-name='nvlist_add_int16' filepath='../../module/nvpair/nvpair.c' line='1306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int16'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1306' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1306' column='1'/>
      <parameter type-id='type-id-10' name='val' filepath='../../module/nvpair/nvpair.c' line='1306' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8' mangled-name='nvlist_add_uint8' filepath='../../module/nvpair/nvpair.c' line='1300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint8'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1300' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1300' column='1'/>
      <parameter type-id='type-id-7' name='val' filepath='../../module/nvpair/nvpair.c' line='1300' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_int8' mangled-name='nvlist_add_int8' filepath='../../module/nvpair/nvpair.c' line='1294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int8'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1294' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1294' column='1'/>
      <parameter type-id='type-id-11' name='val' filepath='../../module/nvpair/nvpair.c' line='1294' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_byte' mangled-name='nvlist_add_byte' filepath='../../module/nvpair/nvpair.c' line='1288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_byte'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1288' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1288' column='1'/>
      <parameter type-id='type-id-12' name='val' filepath='../../module/nvpair/nvpair.c' line='1288' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_value' mangled-name='nvlist_add_boolean_value' filepath='../../module/nvpair/nvpair.c' line='1282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean_value'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1282' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1282' column='1'/>
      <parameter type-id='type-id-13' name='val' filepath='../../module/nvpair/nvpair.c' line='1282' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean' mangled-name='nvlist_add_boolean' filepath='../../module/nvpair/nvpair.c' line='1276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1276' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='1276' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_dup' mangled-name='nvlist_dup' filepath='../../module/nvpair/nvpair.c' line='916' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_dup'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='916' column='1'/>
      <parameter type-id='type-id-27' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='916' column='1'/>
      <parameter type-id='type-id-51' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='916' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_free' mangled-name='nvlist_free' filepath='../../module/nvpair/nvpair.c' line='866' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_free'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='866' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_alloc' mangled-name='nvlist_alloc' filepath='../../module/nvpair/nvpair.c' line='585' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_alloc'>
      <parameter type-id='type-id-27' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='585' column='1'/>
      <parameter type-id='type-id-28' name='nvflag' filepath='../../module/nvpair/nvpair.c' line='585' column='1'/>
      <parameter type-id='type-id-51' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='585' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_nvflag' mangled-name='nvlist_nvflag' filepath='../../module/nvpair/nvpair.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_nvflag'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='559' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nv_alloc' mangled-name='nvlist_lookup_nv_alloc' filepath='../../module/nvpair/nvpair.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nv_alloc'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='188' column='1'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='nv_alloc_fini' mangled-name='nv_alloc_fini' filepath='../../module/nvpair/nvpair.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_fini'>
      <parameter type-id='type-id-78' name='nva' filepath='../../module/nvpair/nvpair.c' line='181' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nv_alloc_reset' mangled-name='nv_alloc_reset' filepath='../../module/nvpair/nvpair.c' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_reset'>
      <parameter type-id='type-id-78' name='nva' filepath='../../module/nvpair/nvpair.c' line='174' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nv_alloc_init' mangled-name='nv_alloc_init' filepath='../../module/nvpair/nvpair.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_init'>
      <parameter type-id='type-id-78' name='nva' filepath='../../module/nvpair/nvpair.c' line='157' column='1'/>
      <parameter type-id='type-id-79' name='nvo' filepath='../../module/nvpair/nvpair.c' line='157' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_xalloc' mangled-name='nvlist_xalloc' filepath='../../module/nvpair/nvpair.c' line='591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xalloc'>
      <parameter type-id='type-id-27' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='591' column='1'/>
      <parameter type-id='type-id-28' name='nvflag' filepath='../../module/nvpair/nvpair.c' line='591' column='1'/>
      <parameter type-id='type-id-78' name='nva' filepath='../../module/nvpair/nvpair.c' line='591' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_remove_nvpair' mangled-name='nvlist_remove_nvpair' filepath='../../module/nvpair/nvpair.c' line='978' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove_nvpair'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='978' column='1'/>
      <parameter type-id='type-id-1' name='nvp' filepath='../../module/nvpair/nvpair.c' line='978' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' mangled-name='nvlist_remove_all' filepath='../../module/nvpair/nvpair.c' line='945' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove_all'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='945' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='945' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_remove' mangled-name='nvlist_remove' filepath='../../module/nvpair/nvpair.c' line='965' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='965' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../../module/nvpair/nvpair.c' line='965' column='1'/>
      <parameter type-id='type-id-57' name='type' filepath='../../module/nvpair/nvpair.c' line='965' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_xdup' mangled-name='nvlist_xdup' filepath='../../module/nvpair/nvpair.c' line='922' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xdup'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='922' column='1'/>
      <parameter type-id='type-id-27' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='922' column='1'/>
      <parameter type-id='type-id-78' name='nva' filepath='../../module/nvpair/nvpair.c' line='922' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvlist_xpack' mangled-name='nvlist_xpack' filepath='../../module/nvpair/nvpair.c' line='2665' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xpack'>
      <parameter type-id='type-id-2' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2665' column='1'/>
      <parameter type-id='type-id-60' name='bufp' filepath='../../module/nvpair/nvpair.c' line='2665' column='1'/>
      <parameter type-id='type-id-31' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2665' column='1'/>
      <parameter type-id='type-id-51' name='encoding' filepath='../../module/nvpair/nvpair.c' line='2665' column='1'/>
      <parameter type-id='type-id-78' name='nva' filepath='../../module/nvpair/nvpair.c' line='2666' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='xdr_int' mangled-name='xdr_int' filepath='/usr/include/rpc/xdr.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' filepath='/usr/include/string.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='xdr_string' mangled-name='xdr_string' filepath='/usr/include/rpc/xdr.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='xdr_char' mangled-name='xdr_char' filepath='/usr/include/rpc/xdr.h' line='318' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='xdr_longlong_t' mangled-name='xdr_longlong_t' filepath='/usr/include/rpc/xdr.h' line='294' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='xdr_array' mangled-name='xdr_array' filepath='/usr/include/rpc/xdr.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='xdr_u_int' mangled-name='xdr_u_int' filepath='/usr/include/rpc/xdr.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='xdr_u_short' mangled-name='xdr_u_short' filepath='/usr/include/rpc/xdr.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='xdr_short' mangled-name='xdr_short' filepath='/usr/include/rpc/xdr.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='xdr_opaque' mangled-name='xdr_opaque' filepath='/usr/include/rpc/xdr.h' line='313' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='xdr_u_longlong_t' mangled-name='xdr_u_longlong_t' filepath='/usr/include/rpc/xdr.h' line='295' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='xdr_double' mangled-name='xdr_double' filepath='/usr/include/rpc/xdr.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='xdrmem_create' mangled-name='xdrmem_create' filepath='/usr/include/rpc/xdr.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='strtol' mangled-name='strtol' filepath='/usr/include/stdlib.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='strncmp' mangled-name='strncmp' filepath='/usr/include/string.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-79'/>
    <type-decl name='double' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-78'/>
    <typedef-decl name='hrtime_t' type-id='type-id-82' filepath='../../lib/libspl/include/sys/time.h' line='78' column='1' id='type-id-64'/>
    <qualified-type-def type-id='type-id-83' const='yes' id='type-id-80'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-82'/>
    <typedef-decl name='nv_alloc_t' type-id='type-id-84' filepath='../../include/sys/nvpair.h' line='128' column='1' id='type-id-81'/>
    <class-decl name='nv_alloc' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='125' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nva_ops' type-id='type-id-79' visibility='default' filepath='../../include/sys/nvpair.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nva_arg' type-id='type-id-85' visibility='default' filepath='../../include/sys/nvpair.h' line='127' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_ops_t' type-id='type-id-86' filepath='../../include/sys/nvpair.h' line='123' column='1' id='type-id-83'/>
    <class-decl name='nv_alloc_ops' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='130' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nv_ao_init' type-id='type-id-87' visibility='default' filepath='../../include/sys/nvpair.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nv_ao_fini' type-id='type-id-88' visibility='default' filepath='../../include/sys/nvpair.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nv_ao_alloc' type-id='type-id-89' visibility='default' filepath='../../include/sys/nvpair.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nv_ao_free' type-id='type-id-90' visibility='default' filepath='../../include/sys/nvpair.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nv_ao_reset' type-id='type-id-88' visibility='default' filepath='../../include/sys/nvpair.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-85'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-87'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-88'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-89'/>
    <function-type size-in-bits='64' id='type-id-92'>
      <parameter type-id='type-id-78' name='nva'/>
      <return type-id='type-id-26'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='../../module/nvpair/nvpair_alloc_fixed.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libnvpair' language='LANG_C99'>
    <var-decl name='nv_fixed_ops_def' type-id='type-id-80' mangled-name='nv_fixed_ops_def' visibility='default' filepath='../../module/nvpair/nvpair_alloc_fixed.c' line='103' column='1' elf-symbol-id='nv_fixed_ops_def'/>
    <var-decl name='nv_fixed_ops' type-id='type-id-79' mangled-name='nv_fixed_ops' visibility='default' filepath='../../include/sys/nvpair.h' line='138' column='1' elf-symbol-id='nv_fixed_ops'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libnvpair.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libnvpair' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-32'/>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='8' id='type-id-95'>
      <subrange length='1' type-id='type-id-42' id='type-id-96'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-32' size-in-bits='160' id='type-id-97'>
      <subrange length='20' type-id='type-id-42' id='type-id-98'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-99'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-100'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-101'/>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-102'/>
    <type-decl name='double' size-in-bits='64' id='type-id-62'/>
    <type-decl name='int' size-in-bits='32' id='type-id-51'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-52'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-82'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-50'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-53'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-49'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-43'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-48'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-42'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-54'/>
    <type-decl name='variadic parameter type' id='type-id-103'/>
    <type-decl name='void' id='type-id-26'/>
    <typedef-decl name='nvpair_t' type-id='type-id-56' filepath='../../include/sys/nvpair.h' line='82' column='1' id='type-id-36'/>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='73' column='1' id='type-id-56'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-9' visibility='default' filepath='../../include/sys/nvpair.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-10' visibility='default' filepath='../../include/sys/nvpair.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-10' visibility='default' filepath='../../include/sys/nvpair.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-9' visibility='default' filepath='../../include/sys/nvpair.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-57' visibility='default' filepath='../../include/sys/nvpair.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int32_t' type-id='type-id-39' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-9'/>
    <typedef-decl name='__int32_t' type-id='type-id-51' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-39'/>
    <typedef-decl name='int16_t' type-id='type-id-38' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='25' column='1' id='type-id-10'/>
    <typedef-decl name='__int16_t' type-id='type-id-50' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='39' column='1' id='type-id-38'/>
    <typedef-decl name='data_type_t' type-id='type-id-58' filepath='../../include/sys/nvpair.h' line='71' column='1' id='type-id-57'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../include/sys/nvpair.h' line='37' column='1' id='type-id-58'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <typedef-decl name='nvlist_t' type-id='type-id-55' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-35'/>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-9' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-5' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-4' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-5' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-9' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint32_t' type-id='type-id-45' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-5'/>
    <typedef-decl name='__uint32_t' type-id='type-id-48' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-45'/>
    <typedef-decl name='uint64_t' type-id='type-id-46' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-4'/>
    <typedef-decl name='__uint64_t' type-id='type-id-42' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-46'/>
    <typedef-decl name='nvlist_prtctl_t' type-id='type-id-104' filepath='../../include/libnvpair.h' line='84' column='1' id='type-id-105'/>
    <class-decl name='nvlist_prtctl' size-in-bits='576' is-struct='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='91' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvprt_fp' type-id='type-id-107' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvprt_indent_mode' type-id='type-id-108' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvprt_indent' type-id='type-id-51' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvprt_indentinc' type-id='type-id-51' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nvprt_nmfmt' type-id='type-id-14' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nvprt_eomfmt' type-id='type-id-14' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nvprt_btwnarrfmt' type-id='type-id-14' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvprt_btwnarrfmt_nl' type-id='type-id-51' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nvprt_dfltops' type-id='type-id-109' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nvprt_custops' type-id='type-id-109' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='101' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-110' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-111'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-51' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-3' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-112' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-113' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-51' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-51' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-114' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-53' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-95' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-115' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-116' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-117' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-118' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-113' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-85' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-30' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-51' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-97' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__off_t' type-id='type-id-52' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-114'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-26' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-119'/>
    <typedef-decl name='__off64_t' type-id='type-id-52' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-116'/>
    <typedef-decl name='size_t' type-id='type-id-42' filepath='/usr/lib/gcc/x86_64-linux-gnu/10/include/stddef.h' line='209' column='1' id='type-id-30'/>
    <enum-decl name='nvlist_indent_mode' filepath='../../include/libnvpair.h' line='86' column='1' id='type-id-108'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='NVLIST_INDENT_ABS' value='0'/>
      <enumerator name='NVLIST_INDENT_TABBED' value='1'/>
    </enum-decl>
    <class-decl name='nvlist_printops' size-in-bits='3456' is-struct='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='61' column='1' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='print_boolean' type-id='type-id-121' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='print_boolean_value' type-id='type-id-122' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='print_byte' type-id='type-id-123' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='print_int8' type-id='type-id-124' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='print_uint8' type-id='type-id-125' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='print_int16' type-id='type-id-126' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='print_uint16' type-id='type-id-127' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='print_int32' type-id='type-id-128' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='print_uint32' type-id='type-id-129' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='print_int64' type-id='type-id-130' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='print_uint64' type-id='type-id-131' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='print_double' type-id='type-id-132' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='print_string' type-id='type-id-133' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='print_hrtime' type-id='type-id-134' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='print_nvlist' type-id='type-id-135' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='print_boolean_array' type-id='type-id-136' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='print_byte_array' type-id='type-id-137' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='print_int8_array' type-id='type-id-138' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='print_uint8_array' type-id='type-id-139' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='print_int16_array' type-id='type-id-140' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='print_uint16_array' type-id='type-id-141' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='print_int32_array' type-id='type-id-142' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='print_uint32_array' type-id='type-id-143' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='print_int64_array' type-id='type-id-144' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='print_uint64_array' type-id='type-id-145' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='print_string_array' type-id='type-id-146' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='print_nvlist_array' type-id='type-id-147' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='62' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-148' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='63' column='1' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-149' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='boolean_t' type-id='type-id-37' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-13'/>
    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-37'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='64' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-150' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uchar_t' type-id='type-id-43' filepath='../../lib/libspl/include/sys/stdtypes.h' line='31' column='1' id='type-id-12'/>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='65' column='1' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-151' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int8_t' type-id='type-id-41' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='24' column='1' id='type-id-11'/>
    <typedef-decl name='__int8_t' type-id='type-id-53' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='37' column='1' id='type-id-41'/>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='66' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-152' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='66' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint8_t' type-id='type-id-47' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-7'/>
    <typedef-decl name='__uint8_t' type-id='type-id-43' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-47'/>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='67' column='1' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-153' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='68' column='1' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-154' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint16_t' type-id='type-id-44' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='25' column='1' id='type-id-6'/>
    <typedef-decl name='__uint16_t' type-id='type-id-54' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-44'/>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='69' column='1' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-155' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='69' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='70' column='1' id='type-id-129'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-156' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='71' column='1' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-157' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int64_t' type-id='type-id-40' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='27' column='1' id='type-id-8'/>
    <typedef-decl name='__int64_t' type-id='type-id-52' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='44' column='1' id='type-id-40'/>
    <class-decl name='__anonymous_struct__10' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='72' column='1' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-158' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='73' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-159' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='74' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-160' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='75' column='1' id='type-id-134'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-161' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='hrtime_t' type-id='type-id-82' filepath='../../lib/libspl/include/sys/time.h' line='78' column='1' id='type-id-64'/>
    <class-decl name='__anonymous_struct__14' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='76' column='1' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-162' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='77' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-163' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint_t' type-id='type-id-48' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-28'/>
    <class-decl name='__anonymous_struct__16' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='78' column='1' id='type-id-137'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-164' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='79' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-165' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='80' column='1' id='type-id-139'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-166' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='81' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-167' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='82' column='1' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-168' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='83' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-169' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='84' column='1' id='type-id-143'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-170' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='85' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-171' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='86' column='1' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-172' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='87' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-173' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='88' column='1' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-174' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-85' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='nvlist_prtctl_fmt' filepath='../../include/libnvpair.h' line='104' column='1' id='type-id-175'>
      <underlying-type type-id='type-id-49'/>
      <enumerator name='NVLIST_FMT_MEMBER_NAME' value='0'/>
      <enumerator name='NVLIST_FMT_MEMBER_POSTAMBLE' value='1'/>
      <enumerator name='NVLIST_FMT_BTWN_ARRAY' value='2'/>
    </enum-decl>
    <typedef-decl name='regex_t' type-id='type-id-176' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-177'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/regex.h' line='413' column='1' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-178' visibility='default' filepath='/usr/include/regex.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-179' visibility='default' filepath='/usr/include/regex.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-179' visibility='default' filepath='/usr/include/regex.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-180' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-3' visibility='default' filepath='/usr/include/regex.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-181' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-30' visibility='default' filepath='/usr/include/regex.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='can_be_null' type-id='type-id-48' visibility='default' filepath='/usr/include/regex.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='regs_allocated' type-id='type-id-48' visibility='default' filepath='/usr/include/regex.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='fastmap_accurate' type-id='type-id-48' visibility='default' filepath='/usr/include/regex.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='no_sub' type-id='type-id-48' visibility='default' filepath='/usr/include/regex.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='not_bol' type-id='type-id-48' visibility='default' filepath='/usr/include/regex.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='not_eol' type-id='type-id-48' visibility='default' filepath='/usr/include/regex.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='newline_anchor' type-id='type-id-48' visibility='default' filepath='/usr/include/regex.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__re_long_size_t' type-id='type-id-42' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-179'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-42' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-180'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-115'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-112'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-118'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-3'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-60'/>
    <qualified-type-def type-id='type-id-32' const='yes' id='type-id-34'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-14'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-163'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-160'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-173'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-159'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-148'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-171'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-165'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' id='type-id-162'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-174'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' id='type-id-149'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-161'/>
    <pointer-type-def type-id='type-id-195' size-in-bits='64' id='type-id-153'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-197' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-151'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-152'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-164'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' id='type-id-170'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-172'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-210'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-212'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-214'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-216'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-218'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-222'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-224'/>
    <pointer-type-def type-id='type-id-225' size-in-bits='64' id='type-id-226'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' id='type-id-228'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' id='type-id-230'/>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' id='type-id-236'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-240'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' id='type-id-242'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-244'/>
    <pointer-type-def type-id='type-id-245' size-in-bits='64' id='type-id-246'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' id='type-id-248'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-250'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-252'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-254'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' id='type-id-256'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-258'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-260'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-262'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-2'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-263'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-181'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-85'/>
    <function-decl name='__builtin_fputc' mangled-name='fputc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='__builtin_fputs' mangled-name='fputs' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_match' mangled-name='nvpair_value_match' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='1274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match'>
      <parameter type-id='type-id-1' name='nvp' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-51' name='ai' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-3' name='value' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-60' name='ep' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='dump_nvlist' mangled-name='dump_nvlist' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='794' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dump_nvlist'>
      <parameter type-id='type-id-2' name='list' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='794' column='1'/>
      <parameter type-id='type-id-51' name='indent' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='794' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prt' mangled-name='nvlist_prt' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prt'>
      <parameter type-id='type-id-2' name='nvl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='766' column='1'/>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='766' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_print' mangled-name='nvlist_print' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='757' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print'>
      <parameter type-id='type-id-107' name='fp' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='757' column='1'/>
      <parameter type-id='type-id-2' name='nvl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='757' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_free' mangled-name='nvlist_prtctl_free' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_free'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='546' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_alloc' mangled-name='nvlist_prtctl_alloc' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_alloc'>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_nvlist_array' mangled-name='nvlist_prtctlop_nvlist_array' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist_array'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <parameter type-id='type-id-230' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_string_array' mangled-name='nvlist_prtctlop_string_array' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string_array'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <parameter type-id='type-id-214' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint64_array' mangled-name='nvlist_prtctlop_uint64_array' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64_array'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <parameter type-id='type-id-260' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int64_array' mangled-name='nvlist_prtctlop_int64_array' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64_array'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <parameter type-id='type-id-224' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint32_array' mangled-name='nvlist_prtctlop_uint32_array' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32_array'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-258' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int32_array' mangled-name='nvlist_prtctlop_int32_array' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='462' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32_array'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <parameter type-id='type-id-222' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint16_array' mangled-name='nvlist_prtctlop_uint16_array' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16_array'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <parameter type-id='type-id-256' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int16_array' mangled-name='nvlist_prtctlop_int16_array' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16_array'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <parameter type-id='type-id-220' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint8_array' mangled-name='nvlist_prtctlop_uint8_array' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8_array'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <parameter type-id='type-id-262' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int8_array' mangled-name='nvlist_prtctlop_int8_array' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8_array'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <parameter type-id='type-id-226' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_byte_array' mangled-name='nvlist_prtctlop_byte_array' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte_array'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <parameter type-id='type-id-254' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean_array' mangled-name='nvlist_prtctlop_boolean_array' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_array'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <parameter type-id='type-id-210' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_nvlist' mangled-name='nvlist_prtctlop_nvlist' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <parameter type-id='type-id-228' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_hrtime' mangled-name='nvlist_prtctlop_hrtime' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='443' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_hrtime'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <parameter type-id='type-id-234' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_string' mangled-name='nvlist_prtctlop_string' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='442' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <parameter type-id='type-id-212' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_double' mangled-name='nvlist_prtctlop_double' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_double'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <parameter type-id='type-id-216' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint64' mangled-name='nvlist_prtctlop_uint64' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <parameter type-id='type-id-250' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int64' mangled-name='nvlist_prtctlop_int64' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-240' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint32' mangled-name='nvlist_prtctlop_uint32' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='438' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <parameter type-id='type-id-248' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int32' mangled-name='nvlist_prtctlop_int32' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <parameter type-id='type-id-238' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint16' mangled-name='nvlist_prtctlop_uint16' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <parameter type-id='type-id-246' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int16' mangled-name='nvlist_prtctlop_int16' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <parameter type-id='type-id-236' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint8' mangled-name='nvlist_prtctlop_uint8' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <parameter type-id='type-id-252' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int8' mangled-name='nvlist_prtctlop_int8' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <parameter type-id='type-id-242' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_byte' mangled-name='nvlist_prtctlop_byte' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <parameter type-id='type-id-244' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean_value' mangled-name='nvlist_prtctlop_boolean_value' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_value'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-232' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean' mangled-name='nvlist_prtctlop_boolean' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <parameter type-id='type-id-218' name='func' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <parameter type-id='type-id-85' name='private' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_dofmt' mangled-name='nvlist_prtctl_dofmt' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_dofmt'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='383' column='1'/>
      <parameter type-id='type-id-175' name='which' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='383' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setfmt' mangled-name='nvlist_prtctl_setfmt' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setfmt'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='350' column='1'/>
      <parameter type-id='type-id-175' name='which' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='350' column='1'/>
      <parameter type-id='type-id-14' name='fmt' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='351' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_doindent' mangled-name='nvlist_prtctl_doindent' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_doindent'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='343' column='1'/>
      <parameter type-id='type-id-51' name='onemore' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='343' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setindent' mangled-name='nvlist_prtctl_setindent' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setindent'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='325' column='1'/>
      <parameter type-id='type-id-108' name='mode' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='325' column='1'/>
      <parameter type-id='type-id-51' name='start' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='326' column='1'/>
      <parameter type-id='type-id-51' name='inc' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='326' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_getdest' mangled-name='nvlist_prtctl_getdest' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_getdest'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='318' column='1'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setdest' mangled-name='nvlist_prtctl_setdest' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setdest'>
      <parameter type-id='type-id-105' name='pctl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='312' column='1'/>
      <parameter type-id='type-id-107' name='fp' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='312' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_match_regex' mangled-name='nvpair_value_match_regex' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='949' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match_regex'>
      <parameter type-id='type-id-1' name='nvp' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='949' column='1'/>
      <parameter type-id='type-id-51' name='ai' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='949' column='1'/>
      <parameter type-id='type-id-3' name='value' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <parameter type-id='type-id-263' name='value_regex' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <parameter type-id='type-id-60' name='ep' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='nvpair_value_byte' mangled-name='nvpair_value_byte' filepath='../../include/sys/nvpair.h' line='248' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_int8' mangled-name='nvpair_value_int8' filepath='../../include/sys/nvpair.h' line='249' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' filepath='../../include/sys/nvpair.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='printf' mangled-name='printf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8' mangled-name='nvpair_value_uint8' filepath='../../include/sys/nvpair.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_int16' mangled-name='nvpair_value_int16' filepath='../../include/sys/nvpair.h' line='251' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16' mangled-name='nvpair_value_uint16' filepath='../../include/sys/nvpair.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_int32' mangled-name='nvpair_value_int32' filepath='../../include/sys/nvpair.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32' mangled-name='nvpair_value_uint32' filepath='../../include/sys/nvpair.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_int64' mangled-name='nvpair_value_int64' filepath='../../include/sys/nvpair.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' mangled-name='nvpair_value_uint64' filepath='../../include/sys/nvpair.h' line='256' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_string' mangled-name='nvpair_value_string' filepath='../../include/sys/nvpair.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_byte_array' mangled-name='nvpair_value_byte_array' filepath='../../include/sys/nvpair.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_int8_array' mangled-name='nvpair_value_int8_array' filepath='../../include/sys/nvpair.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8_array' mangled-name='nvpair_value_uint8_array' filepath='../../include/sys/nvpair.h' line='262' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_int16_array' mangled-name='nvpair_value_int16_array' filepath='../../include/sys/nvpair.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16_array' mangled-name='nvpair_value_uint16_array' filepath='../../include/sys/nvpair.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_int32_array' mangled-name='nvpair_value_int32_array' filepath='../../include/sys/nvpair.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32_array' mangled-name='nvpair_value_uint32_array' filepath='../../include/sys/nvpair.h' line='266' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_int64_array' mangled-name='nvpair_value_int64_array' filepath='../../include/sys/nvpair.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64_array' mangled-name='nvpair_value_uint64_array' filepath='../../include/sys/nvpair.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_string_array' mangled-name='nvpair_value_string_array' filepath='../../include/sys/nvpair.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' filepath='../../include/sys/nvpair.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_type' mangled-name='nvpair_type' filepath='../../include/sys/nvpair.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='dcgettext' mangled-name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist_array' mangled-name='nvpair_value_nvlist_array' filepath='../../include/sys/nvpair.h' line='270' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_value' mangled-name='nvpair_value_boolean_value' filepath='../../include/sys/nvpair.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_double' mangled-name='nvpair_value_double' filepath='../../include/sys/nvpair.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_array' mangled-name='nvpair_value_boolean_array' filepath='../../include/sys/nvpair.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_value_hrtime' mangled-name='nvpair_value_hrtime' filepath='../../include/sys/nvpair.h' line='271' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fprintf' mangled-name='fprintf' filepath='/usr/include/stdio.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' filepath='/usr/include/stdlib.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='malloc' mangled-name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='calloc' mangled-name='calloc' filepath='/usr/include/stdlib.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='__builtin_strchr' mangled-name='strchr' filepath='/usr/include/string.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='sscanf' mangled-name='__isoc99_sscanf' filepath='/usr/include/stdio.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='regexec' mangled-name='regexec' filepath='/usr/include/regex.h' line='643' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' filepath='/usr/include/string.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='nvpair_type_is_array' mangled-name='nvpair_type_is_array' filepath='../../include/sys/nvpair.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='strspn' mangled-name='strspn' filepath='/usr/include/string.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='strcspn' mangled-name='strcspn' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-182'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-183'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-184'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-185'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-186'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-187'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-188'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-189'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-190'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-191'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-192'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-193'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-194'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-195'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-196'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-197'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-198'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-199'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-200'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-201'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-202'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-203'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-204'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-205'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-206'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-207'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-208'>
      <parameter type-id='type-id-104'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-209'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-211'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-213'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-215'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-217'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-219'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-221'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-223'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-225'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-227'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-229'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-231'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-233'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-235'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-237'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-239'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-241'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-243'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-245'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-247'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-249'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-251'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-253'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-255'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-257'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-259'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-261'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-51'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='libnvpair_json.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libnvpair' language='LANG_C99'>
    <function-decl name='nvlist_print_json' mangled-name='nvlist_print_json' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair_json.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print_json'>
      <parameter type-id='type-id-107' name='fp' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair_json.c' line='118' column='1'/>
      <parameter type-id='type-id-2' name='nvl' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/libnvpair_json.c' line='118' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='fnvpair_value_string' mangled-name='fnvpair_value_string' filepath='../../include/sys/nvpair.h' line='351' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvpair_value_byte' mangled-name='fnvpair_value_byte' filepath='../../include/sys/nvpair.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvpair_value_int16' mangled-name='fnvpair_value_int16' filepath='../../include/sys/nvpair.h' line='344' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint16' mangled-name='fnvpair_value_uint16' filepath='../../include/sys/nvpair.h' line='348' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' mangled-name='fnvpair_value_int32' filepath='../../include/sys/nvpair.h' line='345' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint32' mangled-name='fnvpair_value_uint32' filepath='../../include/sys/nvpair.h' line='349' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvpair_value_int64' mangled-name='fnvpair_value_int64' filepath='../../include/sys/nvpair.h' line='346' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' mangled-name='fnvpair_value_uint64' filepath='../../include/sys/nvpair.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' mangled-name='fnvpair_value_nvlist' filepath='../../include/sys/nvpair.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvpair_value_boolean_value' mangled-name='fnvpair_value_boolean_value' filepath='../../include/sys/nvpair.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvpair_value_int8' mangled-name='fnvpair_value_int8' filepath='../../include/sys/nvpair.h' line='343' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint8' mangled-name='fnvpair_value_uint8' filepath='../../include/sys/nvpair.h' line='347' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='__ctype_get_mb_cur_max' mangled-name='__ctype_get_mb_cur_max' filepath='/usr/include/stdlib.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='mbrtowc' mangled-name='mbrtowc' filepath='/usr/include/wchar.h' line='296' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='nvpair_alloc_system.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libnvpair' language='LANG_C99'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-264'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-85' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nv_alloc' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='125' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nva_ops' type-id='type-id-79' visibility='default' filepath='../../include/sys/nvpair.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nva_arg' type-id='type-id-85' visibility='default' filepath='../../include/sys/nvpair.h' line='127' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_ops_t' type-id='type-id-86' filepath='../../include/sys/nvpair.h' line='123' column='1' id='type-id-83'/>
    <class-decl name='nv_alloc_ops' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='130' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nv_ao_init' type-id='type-id-87' visibility='default' filepath='../../include/sys/nvpair.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nv_ao_fini' type-id='type-id-88' visibility='default' filepath='../../include/sys/nvpair.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nv_ao_alloc' type-id='type-id-89' visibility='default' filepath='../../include/sys/nvpair.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nv_ao_free' type-id='type-id-90' visibility='default' filepath='../../include/sys/nvpair.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nv_ao_reset' type-id='type-id-88' visibility='default' filepath='../../include/sys/nvpair.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_t' type-id='type-id-84' filepath='../../include/sys/nvpair.h' line='128' column='1' id='type-id-81'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-265'/>
    <qualified-type-def type-id='type-id-83' const='yes' id='type-id-80'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-87'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-88'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-89'/>
    <var-decl name='nv_alloc_sleep_def' type-id='type-id-81' mangled-name='nv_alloc_sleep_def' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/nvpair_alloc_system.c' line='54' column='1' elf-symbol-id='nv_alloc_sleep_def'/>
    <var-decl name='nv_alloc_nosleep_def' type-id='type-id-81' mangled-name='nv_alloc_nosleep_def' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/nvpair_alloc_system.c' line='59' column='1' elf-symbol-id='nv_alloc_nosleep_def'/>
    <var-decl name='nv_alloc_sleep' type-id='type-id-78' mangled-name='nv_alloc_sleep' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libnvpair/nvpair_alloc_system.c' line='64' column='1' elf-symbol-id='nv_alloc_sleep'/>
    <var-decl name='nv_alloc_nosleep' type-id='type-id-78' mangled-name='nv_alloc_nosleep' visibility='default' filepath='../../include/sys/nvpair.h' line='139' column='1' elf-symbol-id='nv_alloc_nosleep'/>
    <function-type size-in-bits='64' id='type-id-91'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-265'/>
      <return type-id='type-id-51'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-93'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-26'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-94'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-85'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='assert.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libspl' language='LANG_C99'>
    <var-decl name='aok' type-id='type-id-51' mangled-name='aok' visibility='default' filepath='../../lib/libspl/include/assert.h' line='37' column='1' elf-symbol-id='aok'/>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' filepath='/home/rich/zfs_send_prototype/lib/libspl/assert.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='type-id-14' name='file' filepath='/home/rich/zfs_send_prototype/lib/libspl/assert.c' line='32' column='1'/>
      <parameter type-id='type-id-14' name='func' filepath='/home/rich/zfs_send_prototype/lib/libspl/assert.c' line='32' column='1'/>
      <parameter type-id='type-id-51' name='line' filepath='/home/rich/zfs_send_prototype/lib/libspl/assert.c' line='32' column='1'/>
      <parameter type-id='type-id-14' name='format' filepath='/home/rich/zfs_send_prototype/lib/libspl/assert.c' line='33' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='vfprintf' mangled-name='vfprintf' filepath='/usr/include/stdio.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-26'/>
    </function-decl>
