<abi-corpus path='libuutil.so' architecture='elf-amd-x86_64' soname='libuutil.so.3'>
  <elf-needed>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_sol_getmntent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_16_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_32_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_64_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='atomic_add_8_nv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='uu_memdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_msprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_panic' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_set_error' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_setpname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strbw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strcaseeq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_streq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_strndup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vwarn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_vxdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_warn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_xdie' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_zalloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='aok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='buf' size='4110' type='tls-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='pagesize' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_fatal_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_ok_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='uu_exit_usage_value' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='../../module/avl/avl.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libavl' language='LANG_C99'>
    <typedef-decl name='avl_tree_t' type-id='type-id-1' filepath='../../include/sys/avl.h' line='119' column='1' id='type-id-2'/>
    <typedef-decl name='avl_index_t' type-id='type-id-3' filepath='../../include/sys/avl.h' line='130' column='1' id='type-id-4'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-6'/>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' filepath='../../module/avl/avl.c' line='962' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy_nodes'>
      <parameter type-id='type-id-6' name='tree' filepath='../../module/avl/avl.c' line='962' column='1'/>
      <parameter type-id='type-id-7' name='cookie' filepath='../../module/avl/avl.c' line='962' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_is_empty' mangled-name='avl_is_empty' filepath='../../module/avl/avl.c' line='934' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_is_empty'>
      <parameter type-id='type-id-6' name='tree' filepath='../../module/avl/avl.c' line='934' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' filepath='../../module/avl/avl.c' line='927' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_numnodes'>
      <parameter type-id='type-id-6' name='tree' filepath='../../module/avl/avl.c' line='927' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' filepath='../../module/avl/avl.c' line='915' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_destroy'>
      <parameter type-id='type-id-6' name='tree' filepath='../../module/avl/avl.c' line='915' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' filepath='../../module/avl/avl.c' line='892' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_create'>
      <parameter type-id='type-id-6' name='tree' filepath='../../module/avl/avl.c' line='892' column='1'/>
      <parameter type-id='type-id-12' name='compar' filepath='../../module/avl/avl.c' line='892' column='1'/>
      <parameter type-id='type-id-13' name='size' filepath='../../module/avl/avl.c' line='893' column='1'/>
      <parameter type-id='type-id-13' name='offset' filepath='../../module/avl/avl.c' line='893' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_swap' mangled-name='avl_swap' filepath='../../module/avl/avl.c' line='871' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_swap'>
      <parameter type-id='type-id-6' name='tree1' filepath='../../module/avl/avl.c' line='871' column='1'/>
      <parameter type-id='type-id-6' name='tree2' filepath='../../module/avl/avl.c' line='871' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_update' mangled-name='avl_update' filepath='../../module/avl/avl.c' line='851' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update'>
      <parameter type-id='type-id-6' name='t' filepath='../../module/avl/avl.c' line='851' column='1'/>
      <parameter type-id='type-id-8' name='obj' filepath='../../module/avl/avl.c' line='851' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='avl_update_gt' mangled-name='avl_update_gt' filepath='../../module/avl/avl.c' line='834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_gt'>
      <parameter type-id='type-id-6' name='t' filepath='../../module/avl/avl.c' line='834' column='1'/>
      <parameter type-id='type-id-8' name='obj' filepath='../../module/avl/avl.c' line='834' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='avl_update_lt' mangled-name='avl_update_lt' filepath='../../module/avl/avl.c' line='817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_update_lt'>
      <parameter type-id='type-id-6' name='t' filepath='../../module/avl/avl.c' line='817' column='1'/>
      <parameter type-id='type-id-8' name='obj' filepath='../../module/avl/avl.c' line='817' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' filepath='../../module/avl/avl.c' line='669' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_remove'>
      <parameter type-id='type-id-6' name='tree' filepath='../../module/avl/avl.c' line='669' column='1'/>
      <parameter type-id='type-id-8' name='data' filepath='../../module/avl/avl.c' line='669' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_add' mangled-name='avl_add' filepath='../../module/avl/avl.c' line='636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_add'>
      <parameter type-id='type-id-6' name='tree' filepath='../../module/avl/avl.c' line='636' column='1'/>
      <parameter type-id='type-id-8' name='new_node' filepath='../../module/avl/avl.c' line='636' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_insert_here' mangled-name='avl_insert_here' filepath='../../module/avl/avl.c' line='575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert_here'>
      <parameter type-id='type-id-6' name='tree' filepath='../../module/avl/avl.c' line='576' column='1'/>
      <parameter type-id='type-id-8' name='new_data' filepath='../../module/avl/avl.c' line='577' column='1'/>
      <parameter type-id='type-id-8' name='here' filepath='../../module/avl/avl.c' line='578' column='1'/>
      <parameter type-id='type-id-14' name='direction' filepath='../../module/avl/avl.c' line='579' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_insert' mangled-name='avl_insert' filepath='../../module/avl/avl.c' line='486' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_insert'>
      <parameter type-id='type-id-6' name='tree' filepath='../../module/avl/avl.c' line='486' column='1'/>
      <parameter type-id='type-id-8' name='new_data' filepath='../../module/avl/avl.c' line='486' column='1'/>
      <parameter type-id='type-id-4' name='where' filepath='../../module/avl/avl.c' line='486' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_find' mangled-name='avl_find' filepath='../../module/avl/avl.c' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_find'>
      <parameter type-id='type-id-6' name='tree' filepath='../../module/avl/avl.c' line='259' column='1'/>
      <parameter type-id='type-id-8' name='value' filepath='../../module/avl/avl.c' line='259' column='1'/>
      <parameter type-id='type-id-5' name='where' filepath='../../module/avl/avl.c' line='259' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_nearest' mangled-name='avl_nearest' filepath='../../module/avl/avl.c' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_nearest'>
      <parameter type-id='type-id-6' name='tree' filepath='../../module/avl/avl.c' line='230' column='1'/>
      <parameter type-id='type-id-4' name='where' filepath='../../module/avl/avl.c' line='230' column='1'/>
      <parameter type-id='type-id-14' name='direction' filepath='../../module/avl/avl.c' line='230' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_last' mangled-name='avl_last' filepath='../../module/avl/avl.c' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_last'>
      <parameter type-id='type-id-6' name='tree' filepath='../../module/avl/avl.c' line='206' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' filepath='../../module/avl/avl.c' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_first'>
      <parameter type-id='type-id-6' name='tree' filepath='../../module/avl/avl.c' line='187' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='avl_walk' mangled-name='avl_walk' filepath='../../module/avl/avl.c' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='avl_walk'>
      <parameter type-id='type-id-6' name='tree' filepath='../../module/avl/avl.c' line='140' column='1'/>
      <parameter type-id='type-id-8' name='oldnode' filepath='../../module/avl/avl.c' line='140' column='1'/>
      <parameter type-id='type-id-14' name='left' filepath='../../module/avl/avl.c' line='140' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' filepath='../../lib/libspl/include/assert.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-14'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-12'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='146' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-16' visibility='default' filepath='../../include/sys/avl_impl.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-12' visibility='default' filepath='../../include/sys/avl_impl.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-13' visibility='default' filepath='../../include/sys/avl_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-10' visibility='default' filepath='../../include/sys/avl_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-13' visibility='default' filepath='../../include/sys/avl_impl.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='boolean_t' type-id='type-id-17' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-9'/>
    <typedef-decl name='size_t' type-id='type-id-18' filepath='/usr/lib/gcc/x86_64-linux-gnu/10/include/stddef.h' line='209' column='1' id='type-id-13'/>
    <typedef-decl name='uintptr_t' type-id='type-id-18' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-3'/>
    <typedef-decl name='ulong_t' type-id='type-id-18' filepath='../../lib/libspl/include/sys/stdtypes.h' line='34' column='1' id='type-id-10'/>
    <type-decl name='void' id='type-id-11'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-8'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-7'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-16'/>
    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-17'>
      <underlying-type type-id='type-id-20'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-18'/>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='90' column='1' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-21' visibility='default' filepath='../../include/sys/avl_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-3' visibility='default' filepath='../../include/sys/avl_impl.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='128' id='type-id-21'>
      <subrange length='2' type-id='type-id-18' id='type-id-22'/>
    </array-type-def>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='assert.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libspl' language='LANG_C99'>
    <function-decl name='__builtin_fputc' mangled-name='fputc' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <var-decl name='aok' type-id='type-id-14' mangled-name='aok' visibility='default' filepath='../../lib/libspl/include/assert.h' line='37' column='1' elf-symbol-id='aok'/>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' filepath='/home/rich/zfs_send_prototype/lib/libspl/assert.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='type-id-23' name='file' filepath='/home/rich/zfs_send_prototype/lib/libspl/assert.c' line='32' column='1'/>
      <parameter type-id='type-id-23' name='func' filepath='/home/rich/zfs_send_prototype/lib/libspl/assert.c' line='32' column='1'/>
      <parameter type-id='type-id-14' name='line' filepath='/home/rich/zfs_send_prototype/lib/libspl/assert.c' line='32' column='1'/>
      <parameter type-id='type-id-23' name='format' filepath='/home/rich/zfs_send_prototype/lib/libspl/assert.c' line='33' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-23'/>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-24'/>
    <type-decl name='char' size-in-bits='8' id='type-id-25'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='atomic.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libspl' language='LANG_C99'>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-26'/>
    <typedef-decl name='ssize_t' type-id='type-id-27' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='108' column='1' id='type-id-28'/>
    <typedef-decl name='__ssize_t' type-id='type-id-29' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='193' column='1' id='type-id-27'/>
    <typedef-decl name='uint16_t' type-id='type-id-30' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='25' column='1' id='type-id-31'/>
    <typedef-decl name='__uint16_t' type-id='type-id-26' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-30'/>
    <typedef-decl name='int16_t' type-id='type-id-32' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='25' column='1' id='type-id-33'/>
    <typedef-decl name='__int16_t' type-id='type-id-34' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='39' column='1' id='type-id-32'/>
    <typedef-decl name='int32_t' type-id='type-id-35' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-36'/>
    <typedef-decl name='__int32_t' type-id='type-id-14' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='41' column='1' id='type-id-35'/>
    <qualified-type-def type-id='type-id-31' volatile='yes' id='type-id-37'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-38'/>
    <qualified-type-def type-id='type-id-39' volatile='yes' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <qualified-type-def type-id='type-id-42' volatile='yes' id='type-id-43'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-44'/>
    <qualified-type-def type-id='type-id-10' volatile='yes' id='type-id-45'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-46'/>
    <qualified-type-def type-id='type-id-11' volatile='yes' id='type-id-47'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-48'/>
    <function-decl name='membar_consumer' mangled-name='membar_consumer' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_consumer'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='membar_producer' mangled-name='membar_producer' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_producer'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_clear_long_excl' mangled-name='atomic_clear_long_excl' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_clear_long_excl'>
      <parameter type-id='type-id-46' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='326' column='1'/>
      <parameter type-id='type-id-49' name='value' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='326' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='atomic_set_long_excl' mangled-name='atomic_set_long_excl' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_set_long_excl'>
      <parameter type-id='type-id-46' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='318' column='1'/>
      <parameter type-id='type-id-49' name='value' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='318' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='atomic_swap_ptr' mangled-name='atomic_swap_ptr' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ptr'>
      <parameter type-id='type-id-48' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='311' column='1'/>
      <parameter type-id='type-id-8' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='311' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_cas_ptr' mangled-name='atomic_cas_ptr' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ptr'>
      <parameter type-id='type-id-48' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='281' column='1'/>
      <parameter type-id='type-id-8' name='exp' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='281' column='1'/>
      <parameter type-id='type-id-8' name='des' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='281' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr_nv' mangled-name='atomic_sub_ptr_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr_nv'>
      <parameter type-id='type-id-48' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='215' column='1'/>
      <parameter type-id='type-id-28' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='215' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_add_ptr_nv' mangled-name='atomic_add_ptr_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr_nv'>
      <parameter type-id='type-id-48' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='193' column='1'/>
      <parameter type-id='type-id-28' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='193' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='atomic_sub_ptr' mangled-name='atomic_sub_ptr' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_ptr'>
      <parameter type-id='type-id-48' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='103' column='1'/>
      <parameter type-id='type-id-28' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='103' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_add_ptr' mangled-name='atomic_add_ptr' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_ptr'>
      <parameter type-id='type-id-48' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='81' column='1'/>
      <parameter type-id='type-id-28' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='81' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_inc_8' mangled-name='atomic_inc_8' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8'>
      <parameter type-id='type-id-44' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='39' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_inc_16' mangled-name='atomic_inc_16' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16'>
      <parameter type-id='type-id-38' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='41' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_inc_32' mangled-name='atomic_inc_32' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32'>
      <parameter type-id='type-id-41' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='43' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong' mangled-name='atomic_inc_ulong' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong'>
      <parameter type-id='type-id-46' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='45' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_dec_8' mangled-name='atomic_dec_8' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8'>
      <parameter type-id='type-id-44' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='55' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_dec_16' mangled-name='atomic_dec_16' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16'>
      <parameter type-id='type-id-38' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='57' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_dec_32' mangled-name='atomic_dec_32' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32'>
      <parameter type-id='type-id-41' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='59' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong' mangled-name='atomic_dec_ulong' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong'>
      <parameter type-id='type-id-46' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='61' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_add_8' mangled-name='atomic_add_8' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8'>
      <parameter type-id='type-id-44' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='71' column='1'/>
      <parameter type-id='type-id-50' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='71' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_add_16' mangled-name='atomic_add_16' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16'>
      <parameter type-id='type-id-38' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='73' column='1'/>
      <parameter type-id='type-id-33' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='73' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_add_32' mangled-name='atomic_add_32' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32'>
      <parameter type-id='type-id-41' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='75' column='1'/>
      <parameter type-id='type-id-36' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='75' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_sub_8' mangled-name='atomic_sub_8' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8'>
      <parameter type-id='type-id-44' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='93' column='1'/>
      <parameter type-id='type-id-50' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='93' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_sub_16' mangled-name='atomic_sub_16' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16'>
      <parameter type-id='type-id-38' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='95' column='1'/>
      <parameter type-id='type-id-33' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='95' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_sub_32' mangled-name='atomic_sub_32' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32'>
      <parameter type-id='type-id-41' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='97' column='1'/>
      <parameter type-id='type-id-36' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='97' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_or_8' mangled-name='atomic_or_8' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8'>
      <parameter type-id='type-id-44' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='115' column='1'/>
      <parameter type-id='type-id-42' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='115' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_or_16' mangled-name='atomic_or_16' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16'>
      <parameter type-id='type-id-38' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='117' column='1'/>
      <parameter type-id='type-id-31' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='117' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_or_32' mangled-name='atomic_or_32' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32'>
      <parameter type-id='type-id-41' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='119' column='1'/>
      <parameter type-id='type-id-39' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='119' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_or_ulong' mangled-name='atomic_or_ulong' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong'>
      <parameter type-id='type-id-46' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='121' column='1'/>
      <parameter type-id='type-id-10' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='121' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_and_8' mangled-name='atomic_and_8' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8'>
      <parameter type-id='type-id-44' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='131' column='1'/>
      <parameter type-id='type-id-42' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='131' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_and_16' mangled-name='atomic_and_16' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16'>
      <parameter type-id='type-id-38' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='133' column='1'/>
      <parameter type-id='type-id-31' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='133' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_and_32' mangled-name='atomic_and_32' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32'>
      <parameter type-id='type-id-41' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='135' column='1'/>
      <parameter type-id='type-id-39' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='135' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_and_ulong' mangled-name='atomic_and_ulong' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong'>
      <parameter type-id='type-id-46' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='137' column='1'/>
      <parameter type-id='type-id-10' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='137' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='atomic_inc_8_nv' mangled-name='atomic_inc_8_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_8_nv'>
      <parameter type-id='type-id-44' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='151' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='atomic_inc_16_nv' mangled-name='atomic_inc_16_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_16_nv'>
      <parameter type-id='type-id-38' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='153' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_inc_32_nv' mangled-name='atomic_inc_32_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_32_nv'>
      <parameter type-id='type-id-41' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='155' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_inc_ulong_nv' mangled-name='atomic_inc_ulong_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_inc_ulong_nv'>
      <parameter type-id='type-id-46' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='157' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_dec_8_nv' mangled-name='atomic_dec_8_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_8_nv'>
      <parameter type-id='type-id-44' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='167' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='atomic_dec_16_nv' mangled-name='atomic_dec_16_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_16_nv'>
      <parameter type-id='type-id-38' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='169' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_dec_32_nv' mangled-name='atomic_dec_32_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_32_nv'>
      <parameter type-id='type-id-41' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='171' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_dec_ulong_nv' mangled-name='atomic_dec_ulong_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_dec_ulong_nv'>
      <parameter type-id='type-id-46' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='173' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_add_8_nv' mangled-name='atomic_add_8_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_8_nv'>
      <parameter type-id='type-id-44' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='183' column='1'/>
      <parameter type-id='type-id-50' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='183' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='atomic_add_16_nv' mangled-name='atomic_add_16_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_16_nv'>
      <parameter type-id='type-id-38' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='185' column='1'/>
      <parameter type-id='type-id-33' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='185' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_add_32_nv' mangled-name='atomic_add_32_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_32_nv'>
      <parameter type-id='type-id-41' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='187' column='1'/>
      <parameter type-id='type-id-36' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='187' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_add_long_nv' mangled-name='atomic_add_long_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_add_long_nv'>
      <parameter type-id='type-id-46' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='189' column='1'/>
      <parameter type-id='type-id-29' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='189' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_sub_8_nv' mangled-name='atomic_sub_8_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_8_nv'>
      <parameter type-id='type-id-44' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='205' column='1'/>
      <parameter type-id='type-id-50' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='205' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='atomic_sub_16_nv' mangled-name='atomic_sub_16_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_16_nv'>
      <parameter type-id='type-id-38' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='207' column='1'/>
      <parameter type-id='type-id-33' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='207' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_sub_32_nv' mangled-name='atomic_sub_32_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_32_nv'>
      <parameter type-id='type-id-41' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='209' column='1'/>
      <parameter type-id='type-id-36' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='209' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_sub_long_nv' mangled-name='atomic_sub_long_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_sub_long_nv'>
      <parameter type-id='type-id-46' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='211' column='1'/>
      <parameter type-id='type-id-29' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='211' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_or_8_nv' mangled-name='atomic_or_8_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_8_nv'>
      <parameter type-id='type-id-44' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='227' column='1'/>
      <parameter type-id='type-id-42' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='227' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='atomic_or_16_nv' mangled-name='atomic_or_16_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_16_nv'>
      <parameter type-id='type-id-38' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='229' column='1'/>
      <parameter type-id='type-id-31' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='229' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_or_32_nv' mangled-name='atomic_or_32_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_32_nv'>
      <parameter type-id='type-id-41' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='231' column='1'/>
      <parameter type-id='type-id-39' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='231' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_or_ulong_nv' mangled-name='atomic_or_ulong_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_or_ulong_nv'>
      <parameter type-id='type-id-46' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='233' column='1'/>
      <parameter type-id='type-id-10' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='233' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_and_8_nv' mangled-name='atomic_and_8_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_8_nv'>
      <parameter type-id='type-id-44' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='243' column='1'/>
      <parameter type-id='type-id-42' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='243' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='atomic_and_16_nv' mangled-name='atomic_and_16_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_16_nv'>
      <parameter type-id='type-id-38' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='245' column='1'/>
      <parameter type-id='type-id-31' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='245' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_and_32_nv' mangled-name='atomic_and_32_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_32_nv'>
      <parameter type-id='type-id-41' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='247' column='1'/>
      <parameter type-id='type-id-39' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='247' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_and_ulong_nv' mangled-name='atomic_and_ulong_nv' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_and_ulong_nv'>
      <parameter type-id='type-id-46' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='249' column='1'/>
      <parameter type-id='type-id-10' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='249' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_cas_8' mangled-name='atomic_cas_8' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_8'>
      <parameter type-id='type-id-44' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='271' column='1'/>
      <parameter type-id='type-id-42' name='exp' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='271' column='1'/>
      <parameter type-id='type-id-42' name='des' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='271' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='atomic_cas_16' mangled-name='atomic_cas_16' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_16'>
      <parameter type-id='type-id-38' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='273' column='1'/>
      <parameter type-id='type-id-31' name='exp' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='273' column='1'/>
      <parameter type-id='type-id-31' name='des' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='273' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_cas_32' mangled-name='atomic_cas_32' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='275' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_32'>
      <parameter type-id='type-id-41' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='275' column='1'/>
      <parameter type-id='type-id-39' name='exp' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='275' column='1'/>
      <parameter type-id='type-id-39' name='des' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='275' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_cas_ulong' mangled-name='atomic_cas_ulong' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_cas_ulong'>
      <parameter type-id='type-id-46' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='277' column='1'/>
      <parameter type-id='type-id-10' name='exp' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='277' column='1'/>
      <parameter type-id='type-id-10' name='des' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='277' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='atomic_swap_8' mangled-name='atomic_swap_8' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_8'>
      <parameter type-id='type-id-44' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='300' column='1'/>
      <parameter type-id='type-id-42' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='300' column='1'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='atomic_swap_16' mangled-name='atomic_swap_16' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_16'>
      <parameter type-id='type-id-38' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='302' column='1'/>
      <parameter type-id='type-id-31' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='302' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='atomic_swap_32' mangled-name='atomic_swap_32' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='304' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_32'>
      <parameter type-id='type-id-41' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='304' column='1'/>
      <parameter type-id='type-id-39' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='304' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='atomic_swap_ulong' mangled-name='atomic_swap_ulong' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='atomic_swap_ulong'>
      <parameter type-id='type-id-46' name='target' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='306' column='1'/>
      <parameter type-id='type-id-10' name='bits' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='306' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='membar_enter' mangled-name='membar_enter' filepath='/home/rich/zfs_send_prototype/lib/libspl/atomic.c' line='334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='membar_enter'>
      <return type-id='type-id-11'/>
    </function-decl>
    <type-decl name='long int' size-in-bits='64' id='type-id-29'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-34'/>
    <typedef-decl name='int8_t' type-id='type-id-51' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='24' column='1' id='type-id-50'/>
    <typedef-decl name='uint32_t' type-id='type-id-52' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-39'/>
    <typedef-decl name='uint8_t' type-id='type-id-53' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-42'/>
    <typedef-decl name='uint_t' type-id='type-id-54' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-49'/>
    <typedef-decl name='__int8_t' type-id='type-id-55' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='37' column='1' id='type-id-51'/>
    <typedef-decl name='__uint32_t' type-id='type-id-54' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-52'/>
    <typedef-decl name='__uint8_t' type-id='type-id-56' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-53'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-54'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-55'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-56'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='getexecname.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libspl' language='LANG_C99'>
    <function-decl name='getexecname' mangled-name='getexecname' filepath='/home/rich/zfs_send_prototype/lib/libspl/getexecname.c' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getexecname'>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='getexecname_impl' mangled-name='getexecname_impl' filepath='/home/rich/zfs_send_prototype/lib/libspl/libspl_impl.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='list.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libspl' language='LANG_C99'>
    <typedef-decl name='list_t' type-id='type-id-57' filepath='../../lib/libspl/include/sys/list.h' line='36' column='1' id='type-id-58'/>
    <class-decl name='list' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='41' column='1' id='type-id-57'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list_size' type-id='type-id-13' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list_offset' type-id='type-id-13' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='list_head' type-id='type-id-59' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='list_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='36' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-60' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-60' visibility='default' filepath='../../lib/libspl/include/sys/list_impl.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='list_node_t' type-id='type-id-59' filepath='../../lib/libspl/include/sys/list.h' line='35' column='1' id='type-id-61'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' id='type-id-62'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-63'/>
    <function-decl name='list_is_empty' mangled-name='list_is_empty' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_is_empty'>
      <parameter type-id='type-id-63' name='list' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='240' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='list_link_active' mangled-name='list_link_active' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_active'>
      <parameter type-id='type-id-62' name='ln' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='233' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='list_link_init' mangled-name='list_link_init' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_init'>
      <parameter type-id='type-id-62' name='ln' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='226' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='list_link_replace' mangled-name='list_link_replace' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_link_replace'>
      <parameter type-id='type-id-62' name='lold' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='213' column='1'/>
      <parameter type-id='type-id-62' name='lnew' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='213' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='list_move_tail' mangled-name='list_move_tail' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_move_tail'>
      <parameter type-id='type-id-63' name='dst' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='192' column='1'/>
      <parameter type-id='type-id-63' name='src' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='192' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='list_prev' mangled-name='list_prev' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_prev'>
      <parameter type-id='type-id-63' name='list' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='178' column='1'/>
      <parameter type-id='type-id-8' name='object' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='178' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_next' mangled-name='list_next' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_next'>
      <parameter type-id='type-id-63' name='list' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='167' column='1'/>
      <parameter type-id='type-id-8' name='object' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='167' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_tail' mangled-name='list_tail' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_tail'>
      <parameter type-id='type-id-63' name='list' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='159' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_head' mangled-name='list_head' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_head'>
      <parameter type-id='type-id-63' name='list' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='151' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_remove_tail' mangled-name='list_remove_tail' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_tail'>
      <parameter type-id='type-id-63' name='list' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='141' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_remove_head' mangled-name='list_remove_head' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove_head'>
      <parameter type-id='type-id-63' name='list' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='131' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='list_remove' mangled-name='list_remove' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_remove'>
      <parameter type-id='type-id-63' name='list' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='122' column='1'/>
      <parameter type-id='type-id-8' name='object' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='122' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='list_insert_tail' mangled-name='list_insert_tail' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_tail'>
      <parameter type-id='type-id-63' name='list' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='115' column='1'/>
      <parameter type-id='type-id-8' name='object' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='115' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='list_insert_head' mangled-name='list_insert_head' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_head'>
      <parameter type-id='type-id-63' name='list' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='108' column='1'/>
      <parameter type-id='type-id-8' name='object' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='108' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='list_insert_before' mangled-name='list_insert_before' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_before'>
      <parameter type-id='type-id-63' name='list' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='97' column='1'/>
      <parameter type-id='type-id-8' name='object' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='97' column='1'/>
      <parameter type-id='type-id-8' name='nobject' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='97' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='list_insert_after' mangled-name='list_insert_after' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_insert_after'>
      <parameter type-id='type-id-63' name='list' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='86' column='1'/>
      <parameter type-id='type-id-8' name='object' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='86' column='1'/>
      <parameter type-id='type-id-8' name='nobject' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='86' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='list_destroy' mangled-name='list_destroy' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_destroy'>
      <parameter type-id='type-id-63' name='list' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='74' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='list_create' mangled-name='list_create' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='list_create'>
      <parameter type-id='type-id-63' name='list' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='62' column='1'/>
      <parameter type-id='type-id-13' name='size' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='62' column='1'/>
      <parameter type-id='type-id-13' name='offset' filepath='/home/rich/zfs_send_prototype/lib/libspl/list.c' line='62' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='mkdirp.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libspl' language='LANG_C99'>
    <typedef-decl name='mode_t' type-id='type-id-64' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='69' column='1' id='type-id-65'/>
    <typedef-decl name='__mode_t' type-id='type-id-54' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='150' column='1' id='type-id-64'/>
    <function-decl name='mkdirp' mangled-name='mkdirp' filepath='/home/rich/zfs_send_prototype/lib/libspl/mkdirp.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirp'>
      <parameter type-id='type-id-23' name='d' filepath='/home/rich/zfs_send_prototype/lib/libspl/mkdirp.c' line='50' column='1'/>
      <parameter type-id='type-id-65' name='mode' filepath='/home/rich/zfs_send_prototype/lib/libspl/mkdirp.c' line='50' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='strdup' mangled-name='strdup' filepath='/usr/include/string.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='mbstowcs' mangled-name='mbstowcs' filepath='/usr/include/stdlib.h' line='933' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='wcstombs' mangled-name='wcstombs' filepath='/usr/include/stdlib.h' line='936' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='mkdir' mangled-name='mkdir' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='access' mangled-name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/getexecname.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libspl' language='LANG_C99'>
    <function-decl name='readlink' mangled-name='readlink' filepath='/usr/include/unistd.h' line='808' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/gethostid.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libspl' language='LANG_C99'>
    <function-decl name='get_system_hostid' mangled-name='get_system_hostid' filepath='os/linux/gethostid.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_system_hostid'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='open' mangled-name='open64' filepath='/usr/include/fcntl.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='read' mangled-name='read' filepath='/usr/include/unistd.h' line='360' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='close' mangled-name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='getenv' mangled-name='getenv' filepath='/usr/include/stdlib.h' line='634' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strtoull' mangled-name='strtoull' filepath='/usr/include/stdlib.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen64' filepath='/usr/include/stdio.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fscanf' mangled-name='__isoc99_fscanf' filepath='/usr/include/stdio.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/getmntany.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libspl' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-66' size-in-bits='192' id='type-id-67'>
      <subrange length='3' type-id='type-id-18' id='type-id-68'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-25' size-in-bits='8' id='type-id-69'>
      <subrange length='1' type-id='type-id-18' id='type-id-70'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-25' size-in-bits='160' id='type-id-71'>
      <subrange length='20' type-id='type-id-18' id='type-id-72'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-25' size-in-bits='32880' id='type-id-73'>
      <subrange length='4110' type-id='type-id-18' id='type-id-74'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-75'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-76'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-77'/>
    <class-decl name='extmnttab' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='62' column='1' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-79' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-79' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-79' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-79' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mnt_major' type-id='type-id-49' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mnt_minor' type-id='type-id-49' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stat64' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='119' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-81' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-82' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-83' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-64' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-84' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-85' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-14' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-81' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-86' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-87' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-88' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-89' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-89' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-89' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-67' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/stat.h' line='164' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='type-id-18' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='145' column='1' id='type-id-81'/>
    <typedef-decl name='__ino64_t' type-id='type-id-18' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='149' column='1' id='type-id-82'/>
    <typedef-decl name='__nlink_t' type-id='type-id-18' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='151' column='1' id='type-id-83'/>
    <typedef-decl name='__uid_t' type-id='type-id-54' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='146' column='1' id='type-id-84'/>
    <typedef-decl name='__gid_t' type-id='type-id-54' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='147' column='1' id='type-id-85'/>
    <typedef-decl name='__off_t' type-id='type-id-29' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-86'/>
    <typedef-decl name='__blksize_t' type-id='type-id-29' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='174' column='1' id='type-id-87'/>
    <typedef-decl name='__blkcnt64_t' type-id='type-id-29' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='180' column='1' id='type-id-88'/>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='10' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-90' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-66' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__time_t' type-id='type-id-29' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='160' column='1' id='type-id-90'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-29' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='196' column='1' id='type-id-66'/>
    <typedef-decl name='FILE' type-id='type-id-91' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-92'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-14' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-79' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-93' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-94' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-14' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-14' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-86' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-26' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-55' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-69' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-95' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-96' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-97' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-98' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-94' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-8' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-13' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-14' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-71' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_IO_lock_t' type-id='type-id-11' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-99'/>
    <typedef-decl name='__off64_t' type-id='type-id-29' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-96'/>
    <class-decl name='mnttab' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='49' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mnt_special' type-id='type-id-79' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mnt_mountp' type-id='type-id-79' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mnt_fstype' type-id='type-id-79' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mnt_mntopts' type-id='type-id-79' visibility='default' filepath='../../lib/libspl/include/os/linux/sys/mnttab.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-97'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-95'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-104'/>
    <function-decl name='__builtin_fwrite' mangled-name='fwrite' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <var-decl name='buf' type-id='type-id-73' mangled-name='buf' visibility='default' filepath='os/linux/getmntany.c' line='44' column='1' elf-symbol-id='buf'/>
    <function-decl name='getextmntent' mangled-name='getextmntent' filepath='os/linux/getmntany.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getextmntent'>
      <parameter type-id='type-id-23' name='path' filepath='os/linux/getmntany.c' line='106' column='1'/>
      <parameter type-id='type-id-102' name='entry' filepath='os/linux/getmntany.c' line='106' column='1'/>
      <parameter type-id='type-id-104' name='statbuf' filepath='os/linux/getmntany.c' line='106' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='getmntany' mangled-name='getmntany' filepath='os/linux/getmntany.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntany'>
      <parameter type-id='type-id-101' name='fp' filepath='os/linux/getmntany.c' line='51' column='1'/>
      <parameter type-id='type-id-103' name='mgetp' filepath='os/linux/getmntany.c' line='51' column='1'/>
      <parameter type-id='type-id-103' name='mrefp' filepath='os/linux/getmntany.c' line='51' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='_sol_getmntent' mangled-name='_sol_getmntent' filepath='os/linux/getmntany.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_sol_getmntent'>
      <parameter type-id='type-id-101' name='fp' filepath='os/linux/getmntany.c' line='64' column='1'/>
      <parameter type-id='type-id-103' name='mgetp' filepath='os/linux/getmntany.c' line='64' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='__xstat64' mangled-name='__xstat64' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='430' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='feof' mangled-name='feof' filepath='/usr/include/stdio.h' line='759' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='getmntent_r' mangled-name='getmntent_r' filepath='/usr/include/mntent.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-79'/>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='os/linux/zone.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libspl' language='LANG_C99'>
    <typedef-decl name='zoneid_t' type-id='type-id-14' filepath='../../lib/libspl/include/sys/types.h' line='47' column='1' id='type-id-105'/>
    <function-decl name='getzoneid' mangled-name='getzoneid' filepath='os/linux/zone.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getzoneid'>
      <return type-id='type-id-105'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='page.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libspl' language='LANG_C99'>
    <var-decl name='pagesize' type-id='type-id-13' mangled-name='pagesize' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libspl/page.c' line='25' column='1' elf-symbol-id='pagesize'/>
    <function-decl name='spl_pagesize' mangled-name='spl_pagesize' filepath='/home/rich/zfs_send_prototype/lib/libspl/page.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spl_pagesize'>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='sysconf' mangled-name='sysconf' filepath='/usr/include/unistd.h' line='619' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='strlcat.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libspl' language='LANG_C99'>
    <function-decl name='strlcat' mangled-name='strlcat' filepath='/home/rich/zfs_send_prototype/lib/libspl/strlcat.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcat'>
      <parameter type-id='type-id-79' name='dst' filepath='/home/rich/zfs_send_prototype/lib/libspl/strlcat.c' line='39' column='1'/>
      <parameter type-id='type-id-23' name='src' filepath='/home/rich/zfs_send_prototype/lib/libspl/strlcat.c' line='39' column='1'/>
      <parameter type-id='type-id-13' name='dstsize' filepath='/home/rich/zfs_send_prototype/lib/libspl/strlcat.c' line='39' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='strlcpy.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libspl' language='LANG_C99'>
    <function-decl name='strlcpy' mangled-name='strlcpy' filepath='/home/rich/zfs_send_prototype/lib/libspl/strlcpy.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcpy'>
      <parameter type-id='type-id-79' name='dst' filepath='/home/rich/zfs_send_prototype/lib/libspl/strlcpy.c' line='39' column='1'/>
      <parameter type-id='type-id-23' name='src' filepath='/home/rich/zfs_send_prototype/lib/libspl/strlcpy.c' line='39' column='1'/>
      <parameter type-id='type-id-13' name='len' filepath='/home/rich/zfs_send_prototype/lib/libspl/strlcpy.c' line='39' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='timestamp.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libspl' language='LANG_C99'>
    <function-decl name='__builtin_puts' mangled-name='puts' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='print_timestamp' mangled-name='print_timestamp' filepath='/home/rich/zfs_send_prototype/lib/libspl/timestamp.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='print_timestamp'>
      <parameter type-id='type-id-49' name='timestamp_fmt' filepath='/home/rich/zfs_send_prototype/lib/libspl/timestamp.c' line='44' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='localtime' mangled-name='localtime' filepath='/usr/include/time.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strftime' mangled-name='strftime' filepath='/usr/include/time.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='time' mangled-name='time' filepath='/usr/include/time.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='printf' mangled-name='printf' filepath='/usr/include/stdio.h' line='332' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='nl_langinfo' mangled-name='nl_langinfo' filepath='/usr/include/langinfo.h' line='661' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_alloc.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libuutil' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-25'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-18'/>
    <type-decl name='variadic parameter type' id='type-id-106'/>
    <type-decl name='void' id='type-id-11'/>
    <typedef-decl name='size_t' type-id='type-id-18' filepath='/usr/lib/gcc/x86_64-linux-gnu/10/include/stddef.h' line='209' column='1' id='type-id-13'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-79'/>
    <qualified-type-def type-id='type-id-25' const='yes' id='type-id-24'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-8'/>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_msprintf' mangled-name='uu_msprintf' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_alloc.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_msprintf'>
      <parameter type-id='type-id-23' name='format' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_alloc.c' line='108' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-79'/>
    </function-decl>
    <function-decl name='uu_memdup' mangled-name='uu_memdup' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_alloc.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_memdup'>
      <parameter type-id='type-id-8' name='buf' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_alloc.c' line='96' column='1'/>
      <parameter type-id='type-id-13' name='sz' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_alloc.c' line='96' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_strndup' mangled-name='uu_strndup' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_alloc.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strndup'>
      <parameter type-id='type-id-23' name='s' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_alloc.c' line='74' column='1'/>
      <parameter type-id='type-id-13' name='n' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_alloc.c' line='74' column='1'/>
      <return type-id='type-id-79'/>
    </function-decl>
    <function-decl name='__builtin_calloc' mangled-name='calloc' filepath='/usr/include/stdlib.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_strdup' mangled-name='uu_strdup' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_alloc.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strdup'>
      <parameter type-id='type-id-23' name='str' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_alloc.c' line='54' column='1'/>
      <return type-id='type-id-79'/>
    </function-decl>
    <function-decl name='uu_free' mangled-name='uu_free' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_alloc.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_free'>
      <parameter type-id='type-id-8' name='p' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_alloc.c' line='48' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_zalloc' mangled-name='uu_zalloc' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_alloc.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_zalloc'>
      <parameter type-id='type-id-13' name='n' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_alloc.c' line='33' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='vsnprintf' mangled-name='vsnprintf' filepath='/usr/include/stdio.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strnlen' mangled-name='strnlen' filepath='/usr/include/string.h' line='391' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' filepath='/usr/include/string.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' filepath='/usr/include/stdlib.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_set_error' mangled-name='uu_set_error' filepath='../../include/libuutil_impl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_avl.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libuutil' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='128' id='type-id-21'>
      <subrange length='2' type-id='type-id-18' id='type-id-22'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-25' size-in-bits='320' id='type-id-107'>
      <subrange length='40' type-id='type-id-18' id='type-id-108'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-25' size-in-bits='512' id='type-id-109'>
      <subrange length='64' type-id='type-id-18' id='type-id-110'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-14'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-29'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-34'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-55'/>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='192' id='type-id-111'>
      <subrange length='3' type-id='type-id-18' id='type-id-68'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-56'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-54'/>
    <class-decl name='uu_avl' size-in-bits='960' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='131' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ua_next_enc' type-id='type-id-3' visibility='default' filepath='../../include/libuutil_impl.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ua_prev_enc' type-id='type-id-3' visibility='default' filepath='../../include/libuutil_impl.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ua_pool' type-id='type-id-113' visibility='default' filepath='../../include/libuutil_impl.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ua_parent_enc' type-id='type-id-3' visibility='default' filepath='../../include/libuutil_impl.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ua_debug' type-id='type-id-42' visibility='default' filepath='../../include/libuutil_impl.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='ua_index' type-id='type-id-42' visibility='default' filepath='../../include/libuutil_impl.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ua_tree' type-id='type-id-1' visibility='default' filepath='../../include/libuutil_impl.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ua_null_walk' type-id='type-id-114' visibility='default' filepath='../../include/libuutil_impl.h' line='141' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uintptr_t' type-id='type-id-18' filepath='/usr/include/stdint.h' line='90' column='1' id='type-id-3'/>
    <class-decl name='uu_avl_pool' size-in-bits='2176' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='148' column='1' id='type-id-115'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uap_next' type-id='type-id-113' visibility='default' filepath='../../include/libuutil_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uap_prev' type-id='type-id-113' visibility='default' filepath='../../include/libuutil_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uap_name' type-id='type-id-109' visibility='default' filepath='../../include/libuutil_impl.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='uap_nodeoffset' type-id='type-id-13' visibility='default' filepath='../../include/libuutil_impl.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='uap_objsize' type-id='type-id-13' visibility='default' filepath='../../include/libuutil_impl.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='uap_cmp' type-id='type-id-116' visibility='default' filepath='../../include/libuutil_impl.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='uap_debug' type-id='type-id-42' visibility='default' filepath='../../include/libuutil_impl.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <var-decl name='uap_last_index' type-id='type-id-42' visibility='default' filepath='../../include/libuutil_impl.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='uap_lock' type-id='type-id-117' visibility='default' filepath='../../include/libuutil_impl.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='uap_null_avl' type-id='type-id-118' visibility='default' filepath='../../include/libuutil_impl.h' line='159' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_pool_t' type-id='type-id-115' filepath='../../include/libuutil.h' line='259' column='1' id='type-id-119'/>
    <typedef-decl name='uu_compare_fn_t' type-id='type-id-120' filepath='../../include/libuutil.h' line='131' column='1' id='type-id-121'/>
    <typedef-decl name='uint8_t' type-id='type-id-53' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-42'/>
    <typedef-decl name='__uint8_t' type-id='type-id-56' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-53'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-122' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-117'/>
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-122'>
      <data-member access='private'>
        <var-decl name='__data' type-id='type-id-123' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__size' type-id='type-id-107' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__align' type-id='type-id-29' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='22' column='1' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-14' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-14' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-14' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-34' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-34' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-124' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-125' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='53' column='1' id='type-id-124'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='49' column='1' id='type-id-125'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-126' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-126' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_t' type-id='type-id-112' filepath='../../include/libuutil.h' line='260' column='1' id='type-id-118'/>
    <class-decl name='avl_tree' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='146' column='1' id='type-id-1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_root' type-id='type-id-16' visibility='default' filepath='../../include/sys/avl_impl.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avl_compar' type-id='type-id-12' visibility='default' filepath='../../include/sys/avl_impl.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_offset' type-id='type-id-13' visibility='default' filepath='../../include/sys/avl_impl.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avl_numnodes' type-id='type-id-10' visibility='default' filepath='../../include/sys/avl_impl.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avl_size' type-id='type-id-13' visibility='default' filepath='../../include/sys/avl_impl.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/avl_impl.h' line='90' column='1' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avl_child' type-id='type-id-21' visibility='default' filepath='../../include/sys/avl_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avl_pcb' type-id='type-id-3' visibility='default' filepath='../../include/sys/avl_impl.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ulong_t' type-id='type-id-18' filepath='../../lib/libspl/include/sys/stdtypes.h' line='34' column='1' id='type-id-10'/>
    <class-decl name='uu_avl_walk' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='121' column='1' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uaw_next' type-id='type-id-128' visibility='default' filepath='../../include/libuutil_impl.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uaw_prev' type-id='type-id-128' visibility='default' filepath='../../include/libuutil_impl.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uaw_avl' type-id='type-id-129' visibility='default' filepath='../../include/libuutil_impl.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='uaw_next_result' type-id='type-id-8' visibility='default' filepath='../../include/libuutil_impl.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='uaw_dir' type-id='type-id-50' visibility='default' filepath='../../include/libuutil_impl.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='uaw_robust' type-id='type-id-42' visibility='default' filepath='../../include/libuutil_impl.h' line='128' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_avl_walk_t' type-id='type-id-127' filepath='../../include/libuutil.h' line='270' column='1' id='type-id-114'/>
    <typedef-decl name='int8_t' type-id='type-id-51' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='24' column='1' id='type-id-50'/>
    <typedef-decl name='__int8_t' type-id='type-id-55' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='37' column='1' id='type-id-51'/>
    <typedef-decl name='uu_avl_index_t' type-id='type-id-3' filepath='../../include/libuutil.h' line='272' column='1' id='type-id-130'/>
    <typedef-decl name='uu_walk_fn_t' type-id='type-id-15' filepath='../../include/libuutil.h' line='155' column='1' id='type-id-131'/>
    <typedef-decl name='uint32_t' type-id='type-id-52' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-39'/>
    <typedef-decl name='__uint32_t' type-id='type-id-54' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-52'/>
    <typedef-decl name='uu_avl_node_t' type-id='type-id-132' filepath='../../include/libuutil.h' line='268' column='1' id='type-id-133'/>
    <class-decl name='uu_avl_node' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/libuutil.h' line='262' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uan_opaque' type-id='type-id-111' visibility='default' filepath='../../include/libuutil.h' line='264' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' id='type-id-113'/>
    <pointer-type-def type-id='type-id-118' size-in-bits='64' id='type-id-129'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-128'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-7'/>
    <function-decl name='uu_avl_release' mangled-name='uu_avl_release' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='562' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_release'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_avl_lockup' mangled-name='uu_avl_lockup' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_lockup'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_avl_nearest_prev' mangled-name='uu_avl_nearest_prev' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='538' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_nearest_prev'>
      <parameter type-id='type-id-129' name='ap' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='538' column='1'/>
      <parameter type-id='type-id-130' name='idx' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='538' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_avl_nearest_next' mangled-name='uu_avl_nearest_next' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='528' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_nearest_next'>
      <parameter type-id='type-id-129' name='ap' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='528' column='1'/>
      <parameter type-id='type-id-130' name='idx' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='528' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_avl_insert' mangled-name='uu_avl_insert' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='494' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_insert'>
      <parameter type-id='type-id-129' name='ap' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='494' column='1'/>
      <parameter type-id='type-id-8' name='elem' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='494' column='1'/>
      <parameter type-id='type-id-130' name='idx' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='494' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_avl_find' mangled-name='uu_avl_find' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='473' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_find'>
      <parameter type-id='type-id-129' name='ap' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='473' column='1'/>
      <parameter type-id='type-id-8' name='elem' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='473' column='1'/>
      <parameter type-id='type-id-8' name='private' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='473' column='1'/>
      <parameter type-id='type-id-134' name='out' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='473' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_avl_teardown' mangled-name='uu_avl_teardown' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_teardown'>
      <parameter type-id='type-id-129' name='ap' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='458' column='1'/>
      <parameter type-id='type-id-7' name='cookie' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='458' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_avl_remove' mangled-name='uu_avl_remove' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='422' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_remove'>
      <parameter type-id='type-id-129' name='ap' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='422' column='1'/>
      <parameter type-id='type-id-8' name='elem' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='422' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_avl_walk' mangled-name='uu_avl_walk' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk'>
      <parameter type-id='type-id-129' name='ap' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='397' column='1'/>
      <parameter type-id='type-id-136' name='func' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='397' column='1'/>
      <parameter type-id='type-id-8' name='private' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='397' column='1'/>
      <parameter type-id='type-id-39' name='flags' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='397' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='uu_avl_walk_end' mangled-name='uu_avl_walk_end' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='390' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_end'>
      <parameter type-id='type-id-128' name='wp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='390' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_avl_walk_next' mangled-name='uu_avl_walk_next' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_next'>
      <parameter type-id='type-id-128' name='wp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='384' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_avl_walk_start' mangled-name='uu_avl_walk_start' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_walk_start'>
      <parameter type-id='type-id-129' name='ap' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='364' column='1'/>
      <parameter type-id='type-id-39' name='flags' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='364' column='1'/>
      <return type-id='type-id-128'/>
    </function-decl>
    <function-decl name='uu_avl_prev' mangled-name='uu_avl_prev' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_prev'>
      <parameter type-id='type-id-129' name='ap' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='303' column='1'/>
      <parameter type-id='type-id-8' name='node' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='303' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_avl_next' mangled-name='uu_avl_next' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_next'>
      <parameter type-id='type-id-129' name='ap' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='297' column='1'/>
      <parameter type-id='type-id-8' name='node' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='297' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_avl_last' mangled-name='uu_avl_last' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_last'>
      <parameter type-id='type-id-129' name='ap' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='291' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_avl_first' mangled-name='uu_avl_first' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_first'>
      <parameter type-id='type-id-129' name='ap' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='285' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_avl_numnodes' mangled-name='uu_avl_numnodes' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_numnodes'>
      <parameter type-id='type-id-129' name='ap' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='279' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='uu_avl_destroy' mangled-name='uu_avl_destroy' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_destroy'>
      <parameter type-id='type-id-129' name='ap' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='250' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_avl_create' mangled-name='uu_avl_create' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_create'>
      <parameter type-id='type-id-113' name='pp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='211' column='1'/>
      <parameter type-id='type-id-8' name='parent' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='211' column='1'/>
      <parameter type-id='type-id-39' name='flags' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='211' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='uu_avl_node_fini' mangled-name='uu_avl_node_fini' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_node_fini'>
      <parameter type-id='type-id-8' name='base' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='163' column='1'/>
      <parameter type-id='type-id-135' name='np' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='163' column='1'/>
      <parameter type-id='type-id-113' name='pp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='163' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_avl_node_init' mangled-name='uu_avl_node_init' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_node_init'>
      <parameter type-id='type-id-8' name='base' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='138' column='1'/>
      <parameter type-id='type-id-135' name='np' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='138' column='1'/>
      <parameter type-id='type-id-113' name='pp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='138' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_avl_pool_destroy' mangled-name='uu_avl_pool_destroy' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_pool_destroy'>
      <parameter type-id='type-id-113' name='pp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='114' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_avl_pool_create' mangled-name='uu_avl_pool_create' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_avl_pool_create'>
      <parameter type-id='type-id-23' name='name' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='66' column='1'/>
      <parameter type-id='type-id-13' name='objsize' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='66' column='1'/>
      <parameter type-id='type-id-13' name='nodeoffset' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='66' column='1'/>
      <parameter type-id='type-id-116' name='compare_func' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='67' column='1'/>
      <parameter type-id='type-id-39' name='flags' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_avl.c' line='67' column='1'/>
      <return type-id='type-id-113'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' mangled-name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='756' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' mangled-name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='738' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_panic' mangled-name='uu_panic' filepath='../../include/libuutil_impl.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_nearest' mangled-name='avl_nearest' filepath='../../include/sys/avl.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_insert' mangled-name='avl_insert' filepath='../../include/sys/avl.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_find' mangled-name='avl_find' filepath='../../include/sys/avl.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_destroy_nodes' mangled-name='avl_destroy_nodes' filepath='../../include/sys/avl.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_walk' mangled-name='avl_walk' filepath='../../include/sys/avl_impl.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_remove' mangled-name='avl_remove' filepath='../../include/sys/avl.h' line='260' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_free' mangled-name='uu_free' filepath='../../include/libuutil.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_zalloc' mangled-name='uu_zalloc' filepath='../../include/libuutil.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_first' mangled-name='avl_first' filepath='../../include/sys/avl.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_last' mangled-name='avl_last' filepath='../../include/sys/avl.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_numnodes' mangled-name='avl_numnodes' filepath='../../include/sys/avl.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_destroy' mangled-name='avl_destroy' filepath='../../include/sys/avl.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='avl_create' mangled-name='avl_create' filepath='../../include/sys/avl.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' mangled-name='pthread_mutex_destroy' filepath='/usr/include/pthread.h' line='730' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_check_name' mangled-name='uu_check_name' filepath='../../include/libuutil.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strlcpy' mangled-name='strlcpy' filepath='../../lib/libspl/include/string.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' mangled-name='pthread_mutex_init' filepath='/usr/include/pthread.h' line='725' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-15'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-14'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-120'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-14'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_ident.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libuutil' language='LANG_C99'>
    <typedef-decl name='uint_t' type-id='type-id-54' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-49'/>
    <function-decl name='uu_check_name' mangled-name='uu_check_name' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_ident.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_check_name'>
      <parameter type-id='type-id-23' name='name' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_ident.c' line='93' column='1'/>
      <parameter type-id='type-id-49' name='flags' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_ident.c' line='93' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='strchr' mangled-name='strchr' filepath='/usr/include/string.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_list.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libuutil' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-3' size-in-bits='128' id='type-id-137'>
      <subrange length='2' type-id='type-id-18' id='type-id-22'/>
    </array-type-def>
    <class-decl name='uu_list' size-in-bits='896' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='82' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ul_next_enc' type-id='type-id-3' visibility='default' filepath='../../include/libuutil_impl.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ul_prev_enc' type-id='type-id-3' visibility='default' filepath='../../include/libuutil_impl.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ul_pool' type-id='type-id-139' visibility='default' filepath='../../include/libuutil_impl.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ul_parent_enc' type-id='type-id-3' visibility='default' filepath='../../include/libuutil_impl.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ul_offset' type-id='type-id-13' visibility='default' filepath='../../include/libuutil_impl.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ul_numnodes' type-id='type-id-13' visibility='default' filepath='../../include/libuutil_impl.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ul_debug' type-id='type-id-42' visibility='default' filepath='../../include/libuutil_impl.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='392'>
        <var-decl name='ul_sorted' type-id='type-id-42' visibility='default' filepath='../../include/libuutil_impl.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='400'>
        <var-decl name='ul_index' type-id='type-id-42' visibility='default' filepath='../../include/libuutil_impl.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ul_null_node' type-id='type-id-140' visibility='default' filepath='../../include/libuutil_impl.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ul_null_walk' type-id='type-id-141' visibility='default' filepath='../../include/libuutil_impl.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='uu_list_pool' size-in-bits='2112' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='102' column='1' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ulp_next' type-id='type-id-139' visibility='default' filepath='../../include/libuutil_impl.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ulp_prev' type-id='type-id-139' visibility='default' filepath='../../include/libuutil_impl.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ulp_name' type-id='type-id-109' visibility='default' filepath='../../include/libuutil_impl.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ulp_nodeoffset' type-id='type-id-13' visibility='default' filepath='../../include/libuutil_impl.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ulp_objsize' type-id='type-id-13' visibility='default' filepath='../../include/libuutil_impl.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ulp_cmp' type-id='type-id-116' visibility='default' filepath='../../include/libuutil_impl.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='ulp_debug' type-id='type-id-42' visibility='default' filepath='../../include/libuutil_impl.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <var-decl name='ulp_last_index' type-id='type-id-42' visibility='default' filepath='../../include/libuutil_impl.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ulp_lock' type-id='type-id-117' visibility='default' filepath='../../include/libuutil_impl.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='ulp_null_list' type-id='type-id-143' visibility='default' filepath='../../include/libuutil_impl.h' line='113' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_pool_t' type-id='type-id-142' filepath='../../include/libuutil.h' line='160' column='1' id='type-id-144'/>
    <typedef-decl name='uu_list_t' type-id='type-id-138' filepath='../../include/libuutil.h' line='161' column='1' id='type-id-143'/>
    <typedef-decl name='uu_list_node_impl_t' type-id='type-id-145' filepath='../../include/libuutil_impl.h' line='70' column='1' id='type-id-140'/>
    <class-decl name='uu_list_node_impl' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='67' column='1' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uln_next' type-id='type-id-146' visibility='default' filepath='../../include/libuutil_impl.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uln_prev' type-id='type-id-146' visibility='default' filepath='../../include/libuutil_impl.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='uu_list_walk' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/libuutil_impl.h' line='72' column='1' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ulw_next' type-id='type-id-148' visibility='default' filepath='../../include/libuutil_impl.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ulw_prev' type-id='type-id-148' visibility='default' filepath='../../include/libuutil_impl.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ulw_list' type-id='type-id-149' visibility='default' filepath='../../include/libuutil_impl.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ulw_dir' type-id='type-id-50' visibility='default' filepath='../../include/libuutil_impl.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='ulw_robust' type-id='type-id-42' visibility='default' filepath='../../include/libuutil_impl.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ulw_next_result' type-id='type-id-150' visibility='default' filepath='../../include/libuutil_impl.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uu_list_walk_t' type-id='type-id-147' filepath='../../include/libuutil.h' line='167' column='1' id='type-id-141'/>
    <typedef-decl name='uu_list_index_t' type-id='type-id-3' filepath='../../include/libuutil.h' line='169' column='1' id='type-id-151'/>
    <typedef-decl name='uu_list_node_t' type-id='type-id-152' filepath='../../include/libuutil.h' line='165' column='1' id='type-id-153'/>
    <class-decl name='uu_list_node' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/libuutil.h' line='163' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uln_opaque' type-id='type-id-137' visibility='default' filepath='../../include/libuutil.h' line='164' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-139'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' id='type-id-149'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' id='type-id-148'/>
    <function-decl name='uu_list_release' mangled-name='uu_list_release' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_release'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_list_lockup' mangled-name='uu_list_lockup' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_lockup'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_list_prev' mangled-name='uu_list_prev' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_prev'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='685' column='1'/>
      <parameter type-id='type-id-8' name='elem' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='685' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_list_next' mangled-name='uu_list_next' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='674' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_next'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='674' column='1'/>
      <parameter type-id='type-id-8' name='elem' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='674' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_list_last' mangled-name='uu_list_last' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='665' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_last'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='665' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_list_first' mangled-name='uu_list_first' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_first'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='656' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_list_numnodes' mangled-name='uu_list_numnodes' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_numnodes'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='650' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='uu_list_insert_after' mangled-name='uu_list_insert_after' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert_after'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='624' column='1'/>
      <parameter type-id='type-id-8' name='target' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='624' column='1'/>
      <parameter type-id='type-id-8' name='elem' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='624' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='uu_list_insert_before' mangled-name='uu_list_insert_before' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert_before'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='598' column='1'/>
      <parameter type-id='type-id-8' name='target' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='598' column='1'/>
      <parameter type-id='type-id-8' name='elem' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='598' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='uu_list_teardown' mangled-name='uu_list_teardown' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='580' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_teardown'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='580' column='1'/>
      <parameter type-id='type-id-7' name='cookie' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='580' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_list_remove' mangled-name='uu_list_remove' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_remove'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='540' column='1'/>
      <parameter type-id='type-id-8' name='elem' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='540' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_list_walk' mangled-name='uu_list_walk' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='495' column='1'/>
      <parameter type-id='type-id-136' name='func' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='495' column='1'/>
      <parameter type-id='type-id-8' name='private' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='495' column='1'/>
      <parameter type-id='type-id-39' name='flags' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='495' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='uu_list_walk_end' mangled-name='uu_list_walk_end' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_end'>
      <parameter type-id='type-id-148' name='wp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='488' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_list_walk_next' mangled-name='uu_list_walk_next' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_next'>
      <parameter type-id='type-id-148' name='wp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='476' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_list_walk_start' mangled-name='uu_list_walk_start' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_walk_start'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='456' column='1'/>
      <parameter type-id='type-id-39' name='flags' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='456' column='1'/>
      <return type-id='type-id-148'/>
    </function-decl>
    <function-decl name='uu_list_nearest_prev' mangled-name='uu_list_nearest_prev' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_nearest_prev'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='373' column='1'/>
      <parameter type-id='type-id-151' name='idx' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='373' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_list_nearest_next' mangled-name='uu_list_nearest_next' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='348' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_nearest_next'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='348' column='1'/>
      <parameter type-id='type-id-151' name='idx' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='348' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_list_find' mangled-name='uu_list_find' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_find'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='315' column='1'/>
      <parameter type-id='type-id-8' name='elem' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='315' column='1'/>
      <parameter type-id='type-id-8' name='private' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='315' column='1'/>
      <parameter type-id='type-id-154' name='out' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='315' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='uu_list_insert' mangled-name='uu_list_insert' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_insert'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='292' column='1'/>
      <parameter type-id='type-id-8' name='elem' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='292' column='1'/>
      <parameter type-id='type-id-151' name='idx' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='292' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_list_destroy' mangled-name='uu_list_destroy' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_destroy'>
      <parameter type-id='type-id-149' name='lp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='231' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_list_create' mangled-name='uu_list_create' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_create'>
      <parameter type-id='type-id-139' name='pp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='180' column='1'/>
      <parameter type-id='type-id-8' name='parent' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='180' column='1'/>
      <parameter type-id='type-id-39' name='flags' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='180' column='1'/>
      <return type-id='type-id-149'/>
    </function-decl>
    <function-decl name='uu_list_node_fini' mangled-name='uu_list_node_fini' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_node_fini'>
      <parameter type-id='type-id-8' name='base' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='157' column='1'/>
      <parameter type-id='type-id-155' name='np_arg' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='157' column='1'/>
      <parameter type-id='type-id-139' name='pp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='157' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_list_node_init' mangled-name='uu_list_node_init' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_node_init'>
      <parameter type-id='type-id-8' name='base' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='133' column='1'/>
      <parameter type-id='type-id-155' name='np_arg' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='133' column='1'/>
      <parameter type-id='type-id-139' name='pp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='133' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_list_pool_destroy' mangled-name='uu_list_pool_destroy' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_pool_destroy'>
      <parameter type-id='type-id-139' name='pp' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='110' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_list_pool_create' mangled-name='uu_list_pool_create' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_list_pool_create'>
      <parameter type-id='type-id-23' name='name' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='63' column='1'/>
      <parameter type-id='type-id-13' name='objsize' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='63' column='1'/>
      <parameter type-id='type-id-13' name='nodeoffset' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='64' column='1'/>
      <parameter type-id='type-id-116' name='compare_func' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='64' column='1'/>
      <parameter type-id='type-id-39' name='flags' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_list.c' line='64' column='1'/>
      <return type-id='type-id-139'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_misc.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libuutil' language='LANG_C99'>
    <function-decl name='uu_panic' mangled-name='uu_panic' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_misc.c' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_panic'>
      <parameter type-id='type-id-23' name='format' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_misc.c' line='186' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_strerror' mangled-name='uu_strerror' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_misc.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_strerror'>
      <parameter type-id='type-id-39' name='code' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_misc.c' line='118' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='uu_error' mangled-name='uu_error' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_misc.c' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_error'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='uu_set_error' mangled-name='uu_set_error' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_misc.c' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_set_error'>
      <parameter type-id='type-id-49' name='code' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_misc.c' line='73' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_atfork' mangled-name='pthread_atfork' filepath='/usr/include/pthread.h' line='1157' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_self' mangled-name='pthread_self' filepath='/usr/include/pthread.h' line='251' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='vfprintf' mangled-name='vfprintf' filepath='/usr/include/stdio.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pause' mangled-name='pause' filepath='/usr/include/unistd.h' line='469' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='abort' mangled-name='abort' filepath='/usr/include/stdlib.h' line='591' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='dcgettext' mangled-name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_getspecific' mangled-name='pthread_getspecific' filepath='/usr/include/pthread.h' line='1131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_setspecific' mangled-name='pthread_setspecific' filepath='/usr/include/pthread.h' line='1134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_key_create' mangled-name='pthread_key_create' filepath='/usr/include/pthread.h' line='1123' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='uu_pname.c' comp-dir-path='/home/rich/zfs_send_prototype/lib/libuutil' language='LANG_C99'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-156'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-8' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' id='type-id-157'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-158'/>
    <var-decl name='uu_exit_ok_value' type-id='type-id-14' mangled-name='uu_exit_ok_value' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='49' column='1' elf-symbol-id='uu_exit_ok_value'/>
    <var-decl name='uu_exit_fatal_value' type-id='type-id-14' mangled-name='uu_exit_fatal_value' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='50' column='1' elf-symbol-id='uu_exit_fatal_value'/>
    <var-decl name='uu_exit_usage_value' type-id='type-id-14' mangled-name='uu_exit_usage_value' visibility='default' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='51' column='1' elf-symbol-id='uu_exit_usage_value'/>
    <function-decl name='uu_getpname' mangled-name='uu_getpname' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_getpname'>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='uu_setpname' mangled-name='uu_setpname' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_setpname'>
      <parameter type-id='type-id-79' name='arg0' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='167' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='uu_xdie' mangled-name='uu_xdie' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_xdie'>
      <parameter type-id='type-id-14' name='status' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='158' column='1'/>
      <parameter type-id='type-id-23' name='format' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='158' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_vxdie' mangled-name='uu_vxdie' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_vxdie'>
      <parameter type-id='type-id-14' name='status' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='151' column='1'/>
      <parameter type-id='type-id-23' name='format' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='151' column='1'/>
      <parameter type-id='type-id-157' name='alist' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='151' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_die' mangled-name='uu_die' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_die'>
      <parameter type-id='type-id-23' name='format' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='142' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uu_vdie' mangled-name='uu_vdie' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uu_vdie'>
      <parameter type-id='type-id-23' name='format' filepath='/home/rich/zfs_send_prototype/lib/libuutil/uu_pname.c' line='135' column='1'/>
